["the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following comment: \"Transcriptional activator which binds specifically to the MEF2 element, 5'-YTA[AT](4)TAR-3', found in numerous muscle-specific genes. Also involved in the activation of numerous growth factor- and stress-induced genes. Mediates cellular functions not only in skeletal and cardiac muscle development, but also in neuronal differentiation and survival. Plays diverse roles in the control of cell growth, survival and apoptosis via p38 MAPK signaling in muscle-specific and/or growth factor-related transcription. In cerebellar granule neurons, phosphorylated and sumoylated MEF2A represses transcription of NUR77 promoting synaptic differentiation. Associates with chromatin to the ZNF16 promoter\"", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following comment: \"Binds DNA as a homo- or heterodimer. Dimerizes with MEF2D. Interacts with HDAC7 (By similarity). Interacts with PIAS1; the interaction enhances sumoylation. Interacts with HDAC4, HDAC9 and SLC2A4RG. Interacts (via the N-terminal) with MAPK7; the interaction results in the phosphorylation and transcriptional activity of MEF2A\"", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following comment: \"Isoform MEF2 and isoform MEFA are expressed only in skeletal and cardiac muscle and in the brain. Isoform RSRFC4 and isoform RSRFC9 are expressed in all tissues examined\"", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following comment: \"Constitutive phosphorylation on Ser-408 promotes Lys-403 sumoylation thus preventing acetylation at this site. Dephosphorylation on Ser-408 by PPP3CA upon neuron depolarization promotes a switch from sumoylation to acetylation on residue Lys-403 leading to inhibition of dendrite claw differentiation. Phosphorylation on Thr-312 and Thr-319 are the main sites involved in p38 MAPK signaling and activate transcription. Phosphorylated on these sites by MAPK14/p38alpha and MAPK11/p38beta, but not by MAPK13/p38delta nor by MAPK12/p38gamma. Phosphorylation on Ser-408 by CDK5 induced by neurotoxicity inhibits MEF2A transcriptional activation leading to apoptosis of cortical neurons. Phosphorylation on Thr-312, Thr-319 and Ser-355 can be induced by EGF\"", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following comment: \"Sumoylation on Lys-403 is enhanced by PIAS1 and represses transcriptional activity. Phosphorylation on Ser-408 is required for sumoylation. Has no effect on nuclear location nor on DNA binding. Sumoylated with SUMO1 and, to a lesser extent with SUMO2 and SUMO3. PIASx facilitates sumoylation in postsynaptic dendrites in the cerebellar cortex and promotes their morphogenesis (By similarity)\"", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following comment: \"Acetylation on Lys-403 activates transcriptional activity. Acetylated by p300 on several sites in diffentiating myocytes. Acetylation on Lys-4 increases DNA binding and transactivation (By similarity). Hyperacetylation by p300 leads to enhanced cardiac myocyte growth and heart failure\"", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following comment: \"Proteolytically cleaved in cerebellar granule neurons on several sites by caspase 3 and caspase 7 following neurotoxicity. Preferentially cleaves the CDK5-mediated hyperphosphorylated form which leads to neuron apoptosis and transcriptional inactivation\"", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following comment: \"Belongs to the MEF2 family\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"Transcriptional activator which binds specifically to the MEF2 element, 5'-YTA[AT](4)TAR-3', found in numerous muscle-specific genes. Also involved in the activation of numerous growth factor- and stress-induced genes. Mediates cellular functions not only in skeletal and cardiac muscle development, but also in neuronal differentiation and survival. Plays diverse roles in the control of cell growth, survival and apoptosis via p38 MAPK signaling in muscle-specific and/or growth factor-related transcription. In cerebellar granule neurons, phosphorylated and sumoylated MEF2A represses transcription of NUR77 promoting synaptic differentiation. Associates with chromatin to the ZNF16 promoter (By similarity)\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"Binds DNA as a homo- or heterodimer. Dimerizes with MEF2D. Interacts with HDAC7. Interacts with PIAS1; the interaction enhances sumoylation. Interacts with HDAC4, HDAC9 and SLC2A4RG. Interacts (via the N-terminal) with MAPK7; the interaction results in the phosphorylation and transcriptional activity of MEF2A (By similarity)\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"Widely expressed though mainly restricted to skeletal and cardiac muscle, brain, neurons and lymphocytes. Differentially expressed depending on if isoforms contain the beta domain or not, with the total expression of the beta domain-lacking isoforms vastly exceding that of the beta domain-containing isoforms. Isoforms containing the beta domain are expressed primarily in skeletal and cardiac muscle and in brain. Also present in lung and testis. Splicing to include the beta domain is induced in differentiating myocytes. Isoforms lacking the beta domain are expressed less abundantly in skeletal muscle, brain and lymphocytes, and are uniquely found in ovary, liver, spleen and kidney. In embryos, the beta domain-containing and beta domain-lacking isoforms are equally expressed. Also expressed cerebellar granule neurons and other regions of the CNS. Highest levels in the olfactory bulb, cortex, hippocampus, thalamus and cerebellum\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"In the developing cerebellum, increasing levels after birth. The majority of this increase occurs around postnataL day 9 reaching a peak at postnatal day 15-18 which is maintained in adults\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"The beta domain, missing in a number of isoforms, is required for enhancement of transcriptional activity\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"Constitutive phosphorylation on Ser-406 promotes Lys-401 sumoylation thus preventing acetylation at this site. Dephosphorylation on Ser-406 by PPP3CA upon neuron depolarization promotes a switch from sumoylation to acetylation on residue Lys-403 leading to inhibition of dendrite claw differentiation. Phosphorylation on Thr-312 and Thr-319 are the main sites involved in p38 MAPK signaling and activate transcription. Phosphorylated on these sites by MAPK14/p38alpha and MAPK11/p38beta, but not by MAPK13/p38delta nor by MAPK12/p38gamma. Phosphorylation on Ser-408 by CDK5 induced by neurotoxicity inhibits MEF2A transcriptional activation leading to apoptosis of cortical neurons. Phosphorylation on Thr-312, Thr-319 and Ser-355 can be induced by EGF (By similarity). Isoform 3 is phosphorylated on Ser-98 and Thr-108\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"Sumoylation on Lys-401 is enhanced by PIAS1 and represses transcriptional activity. Phosphorylation on Ser-406 is required for sumoylation. Has no effect on nuclear location nor on DNA binding. Sumoylated with SUMO1 and, to a lesser extent with SUMO2 and SUMO3. PIASx facilitates sumoylation in postsynaptic dendrites in the cerebellar cortex and promotes their morphogenesis (By similarity)\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"Acetylation on Lys-401 activates transcriptional activity. Acetylated by p300 on several sites in diffentiating myocytes. Acetylation on Lys-4 increases DNA binding and transactivation. Hyperacetylation by p300 leads to enhanced cardiac myocyte growth and heart failure (By similarity)\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"Proteolytically cleaved in cerebellar granule neurons on several sites by caspase 3 and caspase 7 following neurotoxicity. Preferentially cleaves the CDK5-mediated hyperphosphorylated form which leads to neuron apoptosis and transcriptional inactivation (By similarity)\"", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following comment: \"Belongs to the MEF2 family\"", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following comment: \"Transcriptional activator which binds specifically to the MEF2 element, 5'-YTA[AT](4)TAR-3', found in numerous muscle-specific genes. Also involved in the activation of numerous growth factor- and stress-induced genes. Mediates cellular functions not only in skeletal and cardiac muscle development, but also in neuronal differentiation and survival. Plays diverse roles in the control of cell growth, survival and apoptosis via p38 MAPK signaling in muscle-specific and/or growth factor-related transcription. In cerebellar granule neurons, phosphorylated and sumoylated MEF2A represses transcription of NUR77 promoting synaptic differentiation. Associates with chromatin to the ZNF16 promoter (By similarity)\"", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following comment: \"Binds DNA as a homo- or heterodimer (By similarity). Dimerizes with MEF2D. Interacts with HDAC7. Interacts with PIAS1; the interaction enhances sumoylation. Interacts with HDAC4, HDAC9 and SLC2A4RG. Interacts (via the N-terminal) with MAPK7; the interaction results in the phosphorylation and transcriptional activity of MEF2A (By similarity)\"", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following comment: \"Constitutive phosphorylation on Ser-400 promotes Lys-395 sumoylation thus preventing acetylation at this site. Dephosphorylation on Ser-400 by PPP3CA upon neuron depolarization promotes a switch from sumoylation to acetylation on residue Lys-395 leading to inhibition of dendrite claw differentiation. Phosphorylation on Thr-304 and Thr-311 are the main sites involved in p38 MAPK signaling and activate transcription. Phosphorylated on these sites by MAPK14/p38alpha and MAPK11/p38beta, but not by MAPK13/p38delta nor by MAPK12/p38gamma. Phosphorylation on Ser-400 by CDK5 induced by neurotoxicity inhibits MEF2A transcriptional activation leading to apoptosis of cortical neurons. Phosphorylation on Thr-304, Thr-311 and Ser-347 can be induced by EGF (By similarity)\"", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following comment: \"Sumoylation on Lys-395 is enhanced by PIAS1 and represses transcriptional activity. Phosphorylation on Ser-400 is required for sumoylation. Has no effect on nuclear location nor on DNA binding. Sumoylated with SUMO1 and, to a lesser extent with SUMO2 and SUMO3. PIASx facilitates sumoylation in postsynaptic dendrites in the cerebellar cortex and promotes their morphogenesis (By similarity)\"", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following comment: \"Acetylation on Lys-395 activates transcriptional activity. Acetylated by p300 on several sites in diffentiating myocytes. Acetylation on Lys-4 increases DNA binding and transactivation (By similarity). Hyperacetylation by p300 leads to enhanced cardiac myocyte growth and heart failure (By similarity)\"", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following comment: \"Proteolytically cleaved in cerebellar granule neurons on several sites by caspase 3 and caspase 7 following neurotoxicity. Preferentially cleaves the CDK5-mediated hyperphosphorylated form which leads to neuron apoptosis and transcriptional inactivation (By similarity)\"", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following comment: \"Transcriptional activator which binds specifically to the MEF2 element, 5'-YTA[AT](4)TAR-3', found in numerous muscle-specific genes. Also involved in the activation of numerous growth factor- and stress-induced genes. Mediates cellular functions not only in skeletal and cardiac muscle development, but also in neuronal differentiation and survival. Plays diverse roles in the control of cell growth, survival and apoptosis via p38 MAPK signaling in muscle-specific and/or growth factor-related transcription. In cerebellar granule neurons, phosphorylated and sumoylated MEF2A represses transcription of NUR77 promoting synaptic differentiation. Associates with chromatin to the ZNF16 promoter (By similarity)\"", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following comment: \"Binds DNA as a homo- or heterodimer (By similarity). Dimerizes with MEF2D. Interacts with HDAC7. Interacts with PIAS1; the interaction enhances sumoylation. Interacts with HDAC4, HDAC9 and SLC2A4RG. Interacts (via the N-terminal) with MAPK7; the interaction results in the phosphorylation and transcriptional activity of MEF2A (By similarity)\"", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following comment: \"Constitutive phosphorylation on Ser-400 promotes Lys-395 sumoylation thus preventing acetylation at this site. Dephosphorylation on Ser-400 by PPP3CA upon neuron depolarization promotes a switch from sumoylation to acetylation on residue Lys-395 leading to inhibition of dendrite claw differentiation. Phosphorylation on Thr-304 and Thr-311 are the main sites involved in p38 MAPK signaling and activate transcription. Phosphorylated on these sites by MAPK14/p38alpha and MAPK11/p38beta, but not by MAPK13/p38delta nor by MAPK12/p38gamma. Phosphorylation on Ser-400 by CDK5 induced by neurotoxicity inhibits MEF2A transcriptional activation leading to apoptosis of cortical neurons. Phosphorylation on Thr-304, Thr-311 and Ser-347 can be induced by EGF (By similarity)\"", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following comment: \"Sumoylation on Lys-395 is enhanced by PIAS1 and represses transcriptional activity. Phosphorylation on Ser-400 is required for sumoylation. Has no effect on nuclear location nor on DNA binding. Sumoylated with SUMO1 and, to a lesser extent with SUMO2 and SUMO3. PIASx facilitates sumoylation in postsynaptic dendrites in the cerebellar cortex and promotes their morphogenesis (By similarity)\"", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following comment: \"Acetylation on Lys-395 activates transcriptional activity. Acetylated by p300 on several sites in diffentiating myocytes. Acetylation on Lys-4 increases DNA binding and transactivation (By similarity). Hyperacetylation by p300 leads to enhanced cardiac myocyte growth and heart failure\"", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following comment: \"Proteolytically cleaved in cerebellar granule neurons on several sites by caspase 3 and caspase 7 following neurotoxicity. Preferentially cleaves the CDK5-mediated hyperphosphorylated form which leads to neuron apoptosis and transcriptional inactivation (By similarity)\"", "the MEF2A gene (UniProt: Q03414) in the Xenopus laevis (African clawed frog) species has the following comment: \"May regulate muscle-specific transcription in the embryo and may regulate transcription of a variety of cell types in the adult. Binds to the sequence 5'-CTA[TA]4TAR-3'. Acts downstream of nlk2 in anterior neural development, including eye formation\"", "the MEF2A gene (UniProt: Q03414) in the Xenopus laevis (African clawed frog) species has the following comment: \"Interacts with hdac9 and nlk2\"", "the MEF2A gene (UniProt: Q03414) in the Xenopus laevis (African clawed frog) species has the following comment: \"Restricted to the somitic mesoderm of early embryos. Expressed in the head region of neurula stage embryos and in body muscle (myotomes) of the tadpole. Expressed in all tissues examined in the adult\"", "the MEF2A gene (UniProt: Q03414) in the Xenopus laevis (African clawed frog) species has the following comment: \"Expressed both maternally and zygotically. Zygotic expression begins after the neurula stage\"", "the MEF2A gene (UniProt: Q03414) in the Xenopus laevis (African clawed frog) species has the following comment: \"Belongs to the MEF2 family\"", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following comment: \"Transcriptional activator which binds specifically to the MEF2 element, 5'-YTA[AT](4)TAR-3', found in numerous muscle-specific genes. Also involved in the activation of numerous growth factor- and stress-induced genes. Mediates cellular functions not only in skeletal and cardiac muscle development, but also in neuronal differentiation and survival. Plays diverse roles in the control of cell growth, survival and apoptosis via p38 MAPK signaling in muscle-specific and/or growth factor-related transcription. In cerebellar granule neurons, phosphorylated and sumoylated MEF2A represses transcription of NUR77 promoting synaptic differentiation. Associates with chromatin to the ZNF16 promoter (By similarity)\"", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following comment: \"Binds DNA as a homo- or heterodimer (By similarity). Dimerizes with MEF2D. Interacts with HDAC7. Interacts with PIAS1; the interaction enhances sumoylation. Interacts with HDAC4, HDAC9 and SLC2A4RG. Interacts (via the N-terminal) with MAPK7; the interaction results in the phosphorylation and transcriptional activity of MEF2A (By similarity)\"", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following comment: \"The beta domain, missing in a number of isoforms, is required for enhancement of transcriptional activity\"", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following comment: \"Constitutive phosphorylation on Ser-408 promotes Lys-403 sumoylation thus preventing acetylation at this site. Dephosphorylation on Ser-408 by PPP3CA upon neuron depolarization promotes a switch from sumoylation to acetylation on residue Lys-403 leading to inhibition of dendrite claw differentiation. Phosphorylation on Thr-312 and Thr-319 are the main sites involved in p38 MAPK signaling and activate transcription. Phosphorylated on these sites by MAPK14/p38alpha and MAPK11/p38beta, but not by MAPK13/p38delta nor by MAPK12/p38gamma. Phosphorylation on Ser-408 by CDK5 induced by neurotoxicity inhibits MEF2A transcriptional activation leading to apoptosis of cortical neurons. Phosphorylation on Thr-312, Thr-319 and Ser-355 can be induced by EGF (By similarity)\"", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following comment: \"Sumoylation on Lys-403 is enhanced by PIAS1 and represses transcriptional activity. Phosphorylation on Ser-408 is required for sumoylation. Has no effect on nuclear location nor on DNA binding. Sumoylated with SUMO1 and, to a lesser extent with SUMO2 and SUMO3. PIASx facilitates sumoylation in postsynaptic dendrites in the cerebellar cortex and promotes their morphogenesis (By similarity)\"", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following comment: \"Acetylation on Lys-403 activates transcriptional activity. Acetylated by p300 on several sites in diffentiating myocytes. Acetylation on Lys-4 increases DNA binding and transactivation (By similarity). Hyperacetylation by p300 leads to enhanced cardiac myocyte growth and heart failure (By similarity)\"", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following comment: \"Proteolytically cleaved on several sites by caspase 3 and caspase 7 following neurotoxicity. Preferentially cleaves the CDK5-mediated hyperphosphorylated form which leads to cortical neuron apoptosis and transcriptional inactivation (By similarity)\"", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following comment: \"Belongs to the MEF2 family\"", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following comment: \"Transcriptional activator which binds specifically to the MEF2 element, 5'-YTA[AT](4)TAR-3', found in numerous muscle-specific genes. Also involved in the activation of numerous growth factor- and stress-induced genes. Mediates cellular functions not only in skeletal and cardiac muscle development, but also in neuronal differentiation and survival. Plays diverse roles in the control of cell growth, survival and apoptosis via p38 MAPK signaling in muscle-specific and/or growth factor-related transcription. In cerebellar granule neurons, phosphorylated and sumoylated MEF2A represses transcription of NUR77 promoting synaptic differentiation.Associates with chromatin to the ZNF16 promoter (By similarity)\"", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following comment: \"Binds DNA as a homo- or heterodimer (By similarity). Dimerizes with MEF2D. Interacts with HDAC7. Interacts with PIAS1; the interaction enhances sumoylation. Interacts with HDAC4, HDAC9 and SLC2A4RG. Interacts (via the N-terminal) with MAPK7; the interaction results in the phosphorylation and transcriptional activity of MEF2A (By similarity)\"", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following comment: \"Constitutive phosphorylation on Ser-398 promotes Lys-393 sumoylation thus preventing acetylation at this site. Dephosphorylation on Ser-398 by PPP3CA upon neuron depolarization promotes a switch from sumoylation to acetylation on residue Lys-393 leading to inhibition of dendrite claw differentiation. Phosphorylation on Thr-302 and Thr-309 are the main sites involved in p38 MAPK signaling and activate transcription. Phosphorylated on these sites by MAPK14/p38alpha and MAPK11/p38beta, but not by MAPK13/p38delta nor by MAPK12/p38gamma. Phosphorylation on Ser-398 by CDK5 induced by neurotoxicity inhibits MEF2A transcriptional activation leading to apoptosis of cortical neurons. Phosphorylation on Thr-302, Thr-309 and Ser-345 can be induced by EGF (By similarity)\"", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following comment: \"Sumoylation on Lys-393 is enhanced by PIAS1 and represses transcriptional activity. Phosphorylation on Ser-398 is required for sumoylation. Has no effect on nuclear location nor on DNA binding. Sumoylated with SUMO1 and, to a lesser extent with SUMO2 and SUMO3. PIASx facilitates sumoylation in postsynaptic dendrites in the cerebellar cortex and promotes their morphogenesis (By similarity)\"", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following comment: \"Acetylation on Lys-393 activates transcriptional activity. Acetylated by p300 on several sites in diffentiating myocytes. Acetylation on Lys-4 increases DNA binding and transactivation. Hyperacetylation by p300 leads to enhanced cardiac myocyte growth and heart failure (By similarity)\"", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following comment: \"Proteolytically cleaved in cerebellar granule neurons on several sites by caspase 3 and caspase 7 following neurotoxicity. Preferentially cleaves the CDK5-mediated hyperphosphorylated form which leads to neuron apoptosis and transcriptional inactivation (By similarity)\"", "the MEF2A gene (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following comment: \"Transcription factor that regulates cell differentiation during development. Seems to negatively regulate prestalk gene expression and positively regulate prespore gene expression\"", "the MEF2A gene (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following comment: \"Induced during development in prespore cells\"", "the MEF2A gene (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following comment: \"Leads to slower growth when feeded on bacteria, fewer slugs with lower migration, decreased spore production, reduced cell differentiation, and slightly abnormal prestalk differentiation\"", "the MEF2A gene (UniProt: Q9W6U8) in the Gallus gallus (Chicken) species has the following comment: \"Transcriptional activator which binds specifically to the MEF2 element, 5'-YTA[AT](4)TAR-3', found in numerous muscle-specific genes. Mediates cellular functions in skeletal and cardiac muscle development,\"", "the MEF2A gene (UniProt: Q9W6U8) in the Gallus gallus (Chicken) species has the following comment: \"Binds DNA as a homo- or heterodimer\"", "the MEF2A gene (UniProt: Q9W6U8) in the Gallus gallus (Chicken) species has the following comment: \"Expressed in both embryonic and adult tissues with high expression in heart and skeletal muscle. Also expressed in gut, lung and brain of 15 dpc embryos and adults\"", "the MEF2A gene (UniProt: Q9W6U8) in the Gallus gallus (Chicken) species has the following comment: \"First expressed in stage 8 embryos in the precardiac region and the expression continues during the development of the cardiac tube. Later expression in the atrium and ventricle. From stage 13, expressed in somites. Expression here is limited to the myotome and is not found in newly formed somites until the muscle-specific transcription factors MyoD and myogenin are present\"", "the MEF2A gene (UniProt: Q9W6U8) in the Gallus gallus (Chicken) species has the following comment: \"Sumoylation on Lys-402 is enhanced by PIAS1 and represses transcriptional activity. Has no effect on nuclear location nor on DNA binding. Sumoylated by SUMO1 and, to a lesser extent by SUMO2 and SUMO3 (By similarity)\"", "the MEF2A gene (UniProt: Q9W6U8) in the Gallus gallus (Chicken) species has the following comment: \"Acetylation on Lys-402 activates transcriptional activity\"", "the MEF2A protein (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following comment: \"Transcription factor that regulates cell differentiation during development. Seems to negatively regulate prestalk gene expression and positively regulate prespore gene expression\"", "the MEF2A protein (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following comment: \"Induced during development in prespore cells\"", "the MEF2A protein (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following comment: \"Leads to slower growth when feeded on bacteria, fewer slugs with lower migration, decreased spore production, reduced cell differentiation, and slightly abnormal prestalk differentiation\"", "the MEF2A protein (UniProt: A0A803KHQ2) in the Pan troglodytes (Chimpanzee) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2A protein (UniProt: A0A6D2WIU1) in the Pongo abelii (Sumatran orangutan) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2A protein (UniProt: A0A8J7NFF1) in the Atractosteus spatula (Alligator gar) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2A protein (UniProt: A0A6D2VXR9) in the Pan troglodytes (Chimpanzee) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2A protein (UniProt: A0A6D2WBN7) in the Pan troglodytes (Chimpanzee) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following comment: \"Transcriptional activator which binds specifically to the MEF2 element, 5'-YTA[AT](4)TAR-3', found in numerous muscle-specific genes. Activates transcription via this element. May be involved in muscle-specific and/or growth factor-related transcription\"", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following comment: \"Interacts with HDAC7 (By similarity). Heterodimer. Interacts with HDAC9\"", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following comment: \"Expressed in skeletal and cardiac muscle and brain\"", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following comment: \"Belongs to the MEF2 family\"", "the MEF2B gene (UniProt: O55087) in the Mus musculus (Mouse) species has the following comment: \"Transcriptional activator which binds specifically to the MEF2 element, 5'-YTA[AT](4)TAR-3', found in numerous muscle-specific genes. Activates transcription via this element. May be involved in muscle-specific and/or growth factor-related transcription\"", "the MEF2B gene (UniProt: O55087) in the Mus musculus (Mouse) species has the following comment: \"Heterodimer. Interacts with HDAC9 (By similarity). Interacts with HDAC7\"", "the MEF2B gene (UniProt: O55087) in the Mus musculus (Mouse) species has the following comment: \"Highest expression found in embryonic heart and skeletal muscle. Low levels found in adult spleen, lung and testis while no expression is found in adult heart, brain or skeletal muscle\"", "the MEF2B gene (UniProt: O55087) in the Mus musculus (Mouse) species has the following comment: \"Higher expression in early embryo than in adult\"", "the MEF2B gene (UniProt: O55087) in the Mus musculus (Mouse) species has the following comment: \"Belongs to the MEF2 family\"", "the MEF2B gene (UniProt: A0A1D5QKX1) in the Macaca mulatta (Rhesus macaque) species has the following comment: \"Belongs to the BORCS8 family\"", "the MEF2B gene (UniProt: A0A8M2BHT0) in the Danio rerio (Zebrafish) species has the following comment: \"Belongs to the BORCS8 family\"", "the MEF2B gene (UniProt: A0A1C7ND04) in the Choanephora cucurbitarum () species has the following comment: \"Belongs to the MEF2 family\"", "the MEF2B gene (UniProt: A0A1C7ND04) in the Choanephora cucurbitarum () species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B gene (UniProt: A0A218UC21) in the Lonchura striata domestica (Bengalese finch) species has the following comment: \"Belongs to the BORCS8 family\"", "the MEF2B gene (UniProt: A0A218UC21) in the Lonchura striata domestica (Bengalese finch) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: Q96FH0) in the Homo sapiens (Human) species has the following comment: \"As part of the BORC complex may play a role in lysosomes movement and localization at the cell periphery. Associated with the cytosolic face of lysosomes, the BORC complex may recruit ARL8B and couple lysosomes to microtubule plus-end-directed kinesin motor\"", "the MEF2B protein (UniProt: Q96FH0) in the Homo sapiens (Human) species has the following comment: \"Component of the BLOC-one-related complex (BORC) which is composed of BLOC1S1, BLOC1S2, BORCS5, BORCS6, BORCS7, BORCS8, KXD1 and SNAPIN\"", "the MEF2B protein (UniProt: Q96FH0) in the Homo sapiens (Human) species has the following comment: \"Belongs to the BORCS8 family\"", "the MEF2B protein (UniProt: Q96FH0) in the Homo sapiens (Human) species has the following comment: \"The gene for this protein is either identical to or adjacent to that of MEF2B. Some mRNAs that encode this protein also include MEF2B\"", "the MEF2B protein (UniProt: A0A8X8BMY2) in the Polypterus senegalus (Senegal bichir) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A2J8T5I8) in the Pongo abelii (Sumatran orangutan) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A2J8T5K4) in the Pongo abelii (Sumatran orangutan) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A212D1I4) in the Cervus elaphus hippelaphus (European red deer) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A3L8QB93) in the Chloebia gouldiae (Gouldian finch) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K4WWR1) in the Tachuris rubrigastra () species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K5A1K9) in the Centropus unirufus () species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K6J344) in the Machaerirhynchus nigripectus () species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K6K6R5) in the Oreocharis arfaki (tit berrypecker) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K6W515) in the Steatornis caripensis (Oilbird) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K7UM36) in the Ibidorhyncha struthersii () species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K7XMD6) in the Mohoua ochrocephala () species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K8KIA8) in the Lophotis ruficrista () species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K8LMB0) in the Ardeotis kori () species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K8W5V7) in the Sclerurus mexicanus (tawny-throated leaftosser) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7K9FRY9) in the Stercorarius parasiticus (Parasitic jaeger) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2B protein (UniProt: A0A7L0DG20) in the Rostratula benghalensis (greater painted-snipe) species has the following comment: \"The sequence shown here is derived from an EMBL/GenBank/DDBJ whole genome shotgun (WGS) entry which is preliminary data\"", "the MEF2A gene (UniProt: Q02078) in Homo sapiens (Human) encodes a gene of 507 amino acids with a molecular weight of 54811 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNISIKSEPISPPRDRMTPSGFQQQQQQQQQQQPPPPPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: Q60929) in Mus musculus (Mouse) encodes a gene of 498 amino acids with a molecular weight of 53579 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLADSSMLSPPPATLHRNVSPGAPQRPPSTGSASGMLSTTDLTVPNGAGNSPVGNGFVNSRASPNLIGNTGANSLGKVMPTKSPPPPGGGSLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNAQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFTSPGMLSLGQASAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQPQQQPPPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDTWVT", "the MEF2A gene (UniProt: A2VDZ3) in Bos taurus (Bovine) encodes a gene of 492 amino acids with a molecular weight of 52782 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPSALSYTNPGSSLVSPSLAASSALADTSMLSPPQATLHRNVSPGAPQRPPSTGSAGGMLSTSDLTVPNGAGSSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGSLGMNSRKPDLRVVIPPSSKGMMPPLNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALNSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQPQPPPPPPQAPQPQPRQEVGRSPVDSLSSSSSSYDGSDREDPRGDFHSPVVLGRPPNSEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: Q2MJT0) in Rattus norvegicus (Rat) encodes a gene of 495 amino acids with a molecular weight of 53254 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLAESSMLSPPPATLHRNVSPGAPQRPPSTGSAGGMLSTTDLTVPNGAGNGPVGNGFVDSRASPNLIGNTGANSVGKVMPTKSPPPPGGGSVGMNSRKPDLRVVIPPSSKGMMPPLNAQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFTSPGMLSLGQASAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKTEPISPPRDRMTPSGFQQQQQQQPQQQPPPQPPQPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNAEDRESPSVKRMRMDTWVT", "the MEF2A gene (UniProt: Q03414) in Xenopus laevis (African clawed frog) encodes a gene of 516 amino acids with a molecular weight of 56346 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDDQRYFEEETFSKLIEDSDFVFKRDPALNKKENRGCDSPDPDGSYVLTPHTEEKYKKINEEFDNMMRSHKISPGLPQQTFPMSVTVPVSNPNTLPYSSPGNTMVTASLAASASLTDARMLSPPPTTLHRNVVSPGLPQRPPSTGNAGVMLCSSDLSVPNGAGTSPVGNGFVNPRASPSHLGPTGGNVLGKVMPTKSPPPPGGNLVMNSRKPDLRVVIPPSSKGMMPPLNTQRVTSSQGTQPLATPIVSVATPSLAPQGLIYSAMPTAYNTDYPLTSADLSMLQGFNSPGILPLGQVSAWQQHHVGQAALSSFVATGQLSQGSNLSINTNQNINIKSEPISPPRDRITPSGFQSHQHHQHQPRPEMDSLSSSSSSYDGSDREDVRNDFHSPIGLGRPANNEDRDSPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A2ICN5) in Sus scrofa (Pig) encodes a gene of 507 amino acids with a molecular weight of 54482 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESGTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLADSSMLSPPQATLHRNVSPGAPQRPPSTGSAGGMLSTSDLTVPNGAGSSPVGNGFVNSRASPNLVGTTGANSLGKVMPTESPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQAPQPLATPVVSVTTPSLPQQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQPPPPSQAPQPQPPQPQPQPQPQARQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPVVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: Q5REW7) in Pongo abelii (Sumatran orangutan) encodes a gene of 494 amino acids with a molecular weight of 53138 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLIVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQQPPPPPPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: Q55F37) in Dictyostelium discoideum (Social amoeba) encodes a gene of 1048 amino acids with a molecular weight of 117228 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRNKITIEKISNERNRQATFTKRKNGLIKKAMELSILCDCEIAMIVFSSNNKLFQYSSRDMDKLLIRYTDNTDNTRKNLTNQDYNRVFGNKKSKNDDEDGDDDGDEDLGETPTTPHGNLNAHPIGSMENNNNNNNNNNNNNNNNNNNINNNNNNNNNSHHNNNNGNNNNNNNNNNNNNSNNNSNNNNSNNGNSNNNNNGNNANHNMHHHNGNSANISPMQMSQQANNNNSNNNNNNGNNNSNSNSNNNNNSNGYQQQQQAAQQAVQQAQMAQQMHLQQQQQYQQLQHIQQQQQQQHQQQQQNMGPNGYNHQQQQLQHQSPPPPPQQQQQQMQHSQQQQNMNGIIGHHSPVIVGNGVSLLQPSKWSASPYGEDLAPLTPRSASYKGIYGNQYPPQMQPVVNSNNNSNGNSNSMNNGISSPPINQQNQQNQKPPIMNKPGGGGQPMYYDYNGYPQQQQPPQNYNSNGGYWGQNVSSPPPPQQQQSANPYIQQQQQPQHQSPYYHGNYSPQQQSPVLNSQNGHHSSPMHPHQMHHQQHQHQQHPQMQQQQQQQQQHQQHPQMQQIQQQQHPQMQQHQQHQQQHPQMQQQHMNNHQINHHHLNSSPEINSQKNVHSSPLIMNSNNNNNNNNNNHHGNDNNNNNNNNSNNNNNNNNSNNNNNINNNINSNSNNNSNVNNGNNNNSGKVYNNNNNSNNGNNNNNKPEQTIPVKIEKEHSSSPTIPEQPSINVSTSSNSAHVFNNITSNSNNNNNNNNNNNNNNNNTNNNNNNNNNNNNNNNTNNINSNNNSSNTNVNVINNSSSSSTPPISPANINTQSPAISPALVPVVTSLNPQGEETSKPKFKKSLNLSIVIPEVGNSKYPPPQCKLTPINVEATKQPDIPTLPSPRDFYPEINLHHDNVSLTPNYWGGWHQTPRGSLLLTGNGGSNNSNSSNNNNNNNNNNNNTNNNNISGNGSSSSSSSSTQNPNGFLGCLSPRSFNFLNENNNNNNNNSSSGNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNSNPDESDQSFNRKRKSMEPKN", "the MEF2A gene (UniProt: Q9W6U8) in Gallus gallus (Chicken) encodes a gene of 499 amino acids with a molecular weight of 53669 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPAQNFSMSVTVPVSNPNTLTYSNPGSSLVSPSLAASSSLTSTTMLSPPQTTLHRNVSPGAPQRPPSTGNAGGILGTTDLTVPNGAGTSPVGNGVWNSRASPSLLGTAGGGNGLGKVMPTKSPPPPGGGGLGMNNRKPDLRVVIPPSSKGMMPPLTEEDELELNTQRISSSQSTQPLATPVVSVTTPSFPPAGLVYSAMPTAYNTDYSLTSADLSAFEGFNSPGMLSLGQVSPWQQHHLGPATLSSLVSGSQLSQGSNLSINTNQNINIKSEPISPPRDRVNSSGFPQQQPPQQPQPPQPPQQPPQRQEMGRSPVDSLSSSSSSYDGSDREDPRSDFHSPVVLGRPPNSEDRESPSVKRMRMDTWVT", "the MEF2A gene (UniProt: A0A0S2Z4N0) in Homo sapiens (Human) encodes a gene of 505 amino acids with a molecular weight of 54442 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNISIKSEPISPPRDRMTPSGFQQQQQQQQQQQPPPPPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A0A2K5VXV0) in Macaca fascicularis (Crab-eating macaque) encodes a gene of 503 amino acids with a molecular weight of 54229 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLSVPNGAGSSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQPPPPQPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A0A8C5XN58) in Microcebus murinus (Gray mouse lemur) encodes a gene of 502 amino acids with a molecular weight of 54167 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAVSTKPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLASSSALADSSMLSPPQATLHRNVSPGAPQRPPSTGSAGGMLSTTDLTVPNGAGTSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAVPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQPQPPQPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A0A2I3FW04) in Nomascus leucogenys (Northern white-cheeked gibbon) encodes a gene of 509 amino acids with a molecular weight of 55056 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSALTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTADLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLVNRREELTLHMMISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQPQQQQQQQQPPPPPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A0A2K5KTE9) in Cercocebus atys (Sooty mangabey) encodes a gene of 504 amino acids with a molecular weight of 54326 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLSVPNGAGSSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQPPPPQPQPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A0A2K6BKN0) in Macaca nemestrina (Pig-tailed macaque) encodes a gene of 508 amino acids with a molecular weight of 54855 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAVSTKPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLSVPNGAGSSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQPPPPPQPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A0A2R9B3G6) in Pan paniscus (Pygmy chimpanzee) encodes a gene of 505 amino acids with a molecular weight of 54582 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQQPPPPPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: F6ZR05) in Equus caballus (Horse) encodes a gene of 506 amino acids with a molecular weight of 54697 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAVSTKPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLADSSMLSPPQATLHRNVSPAAPQRPPSTGSAGGMLSTSDLTVPNGAGSSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGNLGMNNRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQQQSQPPQPQPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: G1TNW4) in Oryctolagus cuniculus (Rabbit) encodes a gene of 511 amino acids with a molecular weight of 55177 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPSALPYSNPGNSLVSPSLAASSTLADSSMLSPPQATLHRNVSPGAPQRPPSTGNAGGMLSTTDLTMPNGAGGSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNPQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQTQPQPQPQPPPPPPQPPQPQPQPRQDMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNPEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: G3SD93) in Gorilla gorilla gorilla (Western lowland gorilla) encodes a gene of 504 amino acids with a molecular weight of 54424 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLAVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQQPPPPPPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: H9FUJ6) in Macaca mulatta (Rhesus macaque) encodes a gene of 503 amino acids with a molecular weight of 54198 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLSVPNGAGSSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQPPPPPQPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: I3LQ39) in Sus scrofa (Pig) encodes a gene of 507 amino acids with a molecular weight of 54580 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLADSSMLSPPQATLHRNVSPGAPQRPPSTGSAGGMLSTSDLTVPNGAGSSPVGNGFVNSRASPNLVGTTGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQAPQPLATPVVSVTTPSLPQQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQPPPPSQAPQPQPPQPQPQPQPQARQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPVVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A0A0D9RWI6) in Chlorocebus sabaeus (Green monkey) encodes a gene of 503 amino acids with a molecular weight of 54151 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSALVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLSVPNGAGSSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQPPPPQPPQPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A0A286Y288) in Cavia porcellus (Guinea pig) encodes a gene of 517 amino acids with a molecular weight of 55919 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLADSSMLSPPPATLHRNVSPGAPQRPPSTGNASGMLSTTDLTVPNGAGGSPVGNGFVNSRASPNLIGNTGANSLSKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQAAQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHPLGQAALSSLVTGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQQQQQQQQQQQQQPPLPQPPQPQPQPQPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPVVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: A0A2I3S0F9) in Pan troglodytes (Chimpanzee) encodes a gene of 507 amino acids with a molecular weight of 54741 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAVSTKPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQPPPPPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A gene (UniProt: M3X8U4) in Felis catus (Cat) encodes a gene of 542 amino acids with a molecular weight of 58766 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLADSSMLSPPQATLHRNVSPGVPQRPPSTGSAGGMLSTSDLTVPNGAGSSPVGNGFVNSRASPNLIGTTGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQPQPQPQPPQPPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNSEDRESPSVKRMRMDAWVT", "the MEF2A protein (UniProt: Q55F37) in Dictyostelium discoideum (Social amoeba) encodes a protein of 1048 amino acids with a molecular weight of 117228 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the protein sequence is MGRNKITIEKISNERNRQATFTKRKNGLIKKAMELSILCDCEIAMIVFSSNNKLFQYSSRDMDKLLIRYTDNTDNTRKNLTNQDYNRVFGNKKSKNDDEDGDDDGDEDLGETPTTPHGNLNAHPIGSMENNNNNNNNNNNNNNNNNNNINNNNNNNNNSHHNNNNGNNNNNNNNNNNNNSNNNSNNNNSNNGNSNNNNNGNNANHNMHHHNGNSANISPMQMSQQANNNNSNNNNNNGNNNSNSNSNNNNNSNGYQQQQQAAQQAVQQAQMAQQMHLQQQQQYQQLQHIQQQQQQQHQQQQQNMGPNGYNHQQQQLQHQSPPPPPQQQQQQMQHSQQQQNMNGIIGHHSPVIVGNGVSLLQPSKWSASPYGEDLAPLTPRSASYKGIYGNQYPPQMQPVVNSNNNSNGNSNSMNNGISSPPINQQNQQNQKPPIMNKPGGGGQPMYYDYNGYPQQQQPPQNYNSNGGYWGQNVSSPPPPQQQQSANPYIQQQQQPQHQSPYYHGNYSPQQQSPVLNSQNGHHSSPMHPHQMHHQQHQHQQHPQMQQQQQQQQQHQQHPQMQQIQQQQHPQMQQHQQHQQQHPQMQQQHMNNHQINHHHLNSSPEINSQKNVHSSPLIMNSNNNNNNNNNNHHGNDNNNNNNNNSNNNNNNNNSNNNNNINNNINSNSNNNSNVNNGNNNNSGKVYNNNNNSNNGNNNNNKPEQTIPVKIEKEHSSSPTIPEQPSINVSTSSNSAHVFNNITSNSNNNNNNNNNNNNNNNNTNNNNNNNNNNNNNNNTNNINSNNNSSNTNVNVINNSSSSSTPPISPANINTQSPAISPALVPVVTSLNPQGEETSKPKFKKSLNLSIVIPEVGNSKYPPPQCKLTPINVEATKQPDIPTLPSPRDFYPEINLHHDNVSLTPNYWGGWHQTPRGSLLLTGNGGSNNSNSSNNNNNNNNNNNNTNNNNISGNGSSSSSSSSTQNPNGFLGCLSPRSFNFLNENNNNNNNNSSSGNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNSNPDESDQSFNRKRKSMEPKN", "the MEF2A protein (UniProt: A0A2J8VXQ5) in Pongo abelii (Sumatran orangutan) encodes a protein of 502 amino acids with a molecular weight of 54085 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQQPPPPPPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A protein (UniProt: A1YGF0) in Pan paniscus (Pygmy chimpanzee) encodes a protein of 187 amino acids with a molecular weight of 20686 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is VTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNA", "the MEF2A protein (UniProt: A2D5A9) in Hylobates klossii (Kloss's gibbon) encodes a protein of 187 amino acids with a molecular weight of 20656 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is VTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSALTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNA", "the MEF2A protein (UniProt: A2T7W8) in Pongo pygmaeus (Bornean orangutan) encodes a protein of 114 amino acids with a molecular weight of 13345 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is VTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIA", "the MEF2A protein (UniProt: A2T7B1) in Pan troglodytes (Chimpanzee) encodes a protein of 114 amino acids with a molecular weight of 13345 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is VTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIA", "the MEF2A protein (UniProt: A0A803KHQ2) in Pan troglodytes (Chimpanzee) encodes a protein of 493 amino acids with a molecular weight of 52997 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQPPPPPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A protein (UniProt: A0A6D2WIU1) in Pongo abelii (Sumatran orangutan) encodes a protein of 494 amino acids with a molecular weight of 53126 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQQPPPPPPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A protein (UniProt: A0A8J7NFF1) in Atractosteus spatula (Alligator gar) encodes a protein of 987 amino acids with a molecular weight of 106882 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEWKCAEVQVCFTSQNFFTVLSSRLVSRPVPVSNAASEPGDAARCHGALPAVGCWQTGVKRGAWRLPGFLARPRGFPSFLSALPTFSPRPCESAPCAHRYVNVVEEYSPGRTSDLRDFVRAVKVTVFLTTLALKTLAVLKTAMVVSQIQIKLRNKGLSDCASPEPDDCFGHSPTMDERYGKLNEESDLIYKRCGALNKKEHRGCDSPDPDASYVLTPHTEEKYKKINEEFDNMMRNHKIPTALPQQNFSMHVAVPVTNPNTLSYSNPGGSLGSPALAAATASLSDGGMLSPPQGSLHRSVXSPGAPQRPSSTGSAGGMLGTTDLTVPNGAGSSPVGPDWSDEHCTCSSRNASLQFNTGGYGEDRAGSLGTSGQETWRRAESEALAHLQLTVVEFQIWALKLCQGLPHNDIMLPDHYQSPVEKSAVWLARRNVTEHRPLSGCAVVWNGFVNPRGSPGLLGTPSGNGLGKVMPTKSPPPPGGNLGIGNRKPDLRVVIPPSSKGMMPPLSEEDEMDLNTQRISSSQAAQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLSSAELSALQGFSSPGGLALGSMSAWQQHQLGQAALSSLVDEFSILVHYFPFSTAIQLSHGGQSGSHMPQGPNLSINTSQNVHIKSEPISPPRDRFPAQPPPPARPDMGRSPVDSLSSSSSSYDGSDREDPRADFHSPLGLGXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXGLLFIIIIIVLI", "the MEF2A protein (UniProt: A0A3Q1HM09) in Anabas testudineus (Climbing perch) encodes a protein of 569 amino acids with a molecular weight of 60478 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MESETNNREGPPYQNLLLLGAIAAASAFVVTILIVLVCVGCQRKSKTKHPQAGEKGTSVNMQGTLRHPKLNSMSKSDTRLHEINRFPCNGNSVSKSRPASMDLLLLHSRRSQTDLRPSHGRQLPQIPTSPQGSGKGGAETGGNGGGGGGRGGSETRDHTYTEVGLRNNPTPTHCLDDGLYESVGVRESDTSPKVPSAPPPTSVNTPATVRAAQSPPAHANGARNGNGLGNGGRGGNGRGNGTFNGQMTARGNGASGVNRSPLSSVNSLAIQDPPAAEYASIRKFRKVDKTNRKENNGVDSQSDSQSSVSDSPSAAPPPLHRSQEFSRKPLEPFHLHSFPKEPVFIGNGEQYIWKPPEDDDIITLHPPPHRGENGQGHPSPPTAKEIADTYSIVCKTQKKKPPMENNGAKTLPRSFGGEKGNAGSRGRGRGVQGQARSQEDPCYEPVGDRSWSTCAMAEADPAYATIDTHRKREQGATNNGTNGGNATLRRKKQTPQPQPQPQPQQQQQQQQQQQQVAPQGSGPTALPAKGLPGGENFYETISDVKQGGSSSTTTIFTFNDGMEMYVTGL", "the MEF2A protein (UniProt: A0A6D2VXR9) in Pan troglodytes (Chimpanzee) encodes a protein of 501 amino acids with a molecular weight of 53956 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVETLRKKGLNGCESPDADDYFEHSPLSEDRFSKLNEDSDFIFKRGPPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLSEEEELELNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQPPPPPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A protein (UniProt: A0A6D2WBN7) in Pan troglodytes (Chimpanzee) encodes a protein of 495 amino acids with a molecular weight of 53367 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQPPPPPQPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A protein (UniProt: A0A6I9SJL8) in Elaeis guineensis var. tenera (Oil palm) encodes a protein of 382 amino acids with a molecular weight of 42083 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MARRRRRWQFIENQRQRLATYRKRRGGLRKKASQLSSLCGVPIAVISFGPNGRLDTWPDDQGAIHDLLLTYRSFDPEKRRKHDLDLPTLLEAQEGSQNLLWDPRLDAMPTESLRNLTNSLDSKVKAIDERIQQLLEENSKCSNQDNNNSSREQGVNSKCNDQDNNNTGSEQRDDSKSSNQGNNNTSSGRGDDSRGSNEGNNNTSTEQSLPPCSNPVVFDPFPINKRNAYAELFHGLDESGRFIYPPHTSIAFDLYPINYDASMGVATSAWLPDSLSSSVPTDFSHAINSSSQAFSSVPSSPLMPPPSTSNNRAFGNDHPFCPPESSFGDFFESCEFLMGGDDIVGANTFGGTLTIEEPLPSAFGGTLTIEEPLPSAFGPPVQ", "the MEF2A protein (UniProt: A0A1I8MXS1) in Musca domestica (House fly) encodes a protein of 820 amino acids with a molecular weight of 89154 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MATGSTTTNNNNSLNIPPTQYTQIYGNTNTNNNNHNSNNNHNQYANNSSNIYNGNNNNHNNSSSITSSNNSCSNSLTINNNNINSSNSSSVTVTADAATVAIAKDMLQLHHGSALNNNNNNNNNNINDGLNSPAHNNNNSNNNNNNSSSNSATINNRNSNTMTLATPPAPQQQQQQQQQHPQPPQQQMQLQQQQRPPPPPEHAVGFLKYEDELLYITETCTVIGRNSSTSHVHFHVAENNLVSRKHFQVLFDPETRDFYVQCLSKNGIFVDDFLQRRNADHLKLPASCYFRFPSTEIRIQFESFLHTDSSPPDSLAGSHNNMSNSSMNNNHHNISSSSSSASSHHILSGHGGGSSGGGGGGGGGSISASNVHQVIISPASADELNNQQHQQHHPHHQQQLHGGHTTGHQMQHVTSQQQQHQHHATSAGGGGSGGGVASHLLPVDNSNVIYSPLKIAIPKKEQKSPYLSPTGTISAANSCPASPRQGFHQNQNNYNNYSNNNIQNQQDLFQTPSTASYNHNEKPPYSYAQLIVQAISAAPDKQLTLSGIYSFIVKHYPYYRKETNKGWQNSIRHNLSLNRYFIKVARSQDEPGKGSFWRIDPDSGAKLIDHSYKKRRQRSSQGLRPPYGMPRSAPVSPSHMEEYSADNSRESSPLQDIVLQSAPGSPGMSLENRNVDNEIVYQNQNIQQFGTNNAHQYSSSPYITNQNQVITQQQQQHHQEVVASSGGGGGGGGGGVGALIALKRNHAMAAAGTNAVVIGGGGGGNTAITLQQQQQQQQPNLQGLHPDIIYEEMPTDYSGNIVESGDECDAGTKRPKVEVL", "the MEF2A protein (UniProt: A0A6P8WX58) in Drosophila albomicans (Fruit fly) encodes a protein of 586 amino acids with a molecular weight of 64571 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MRMDYQMPPPALALQQQQQQHQQQQQQQQSHNAALQHQQNQLQMLQQQQQHQQQQQQQMLGNMSQATTLPPLSSLPLQVVHNLPHLLAGNGNNSNNNSSNNNNNNTNLNGNNVGVVACNNNNNNNSQASNNLLRNSMQHQLLSNLSNNSNGNNVAAGNGSHVANGALPPPTQLLQHHLQHLAHVNVNAAAAVVAVAANNLSNNLQHSNNGNNSAANNNNNSANNNNNTILNHNNLNIIINNHTNNNNSSNSNNNNNNNNPATPNANLATATPTVNSAASAVAQQQQAHENSLVNSLVGVINGNSNNSNNNNNNNTSNNANSNNANNGDDNNRWTQFQVQQLWKQHANYLNGKSTSNSKEIICPDDKYKEEGDIWNVEAQTAFLGPNLWDKTLPYDADLKVTQYADLDEFLSENNIPDGLPGTHLGHSGGLGHRSDSLSHAAGLSLGLGHITTKRERSPSPSDCISPDTLNPPSPAESTFSFASSGRDFDPRTRAFSDEELKPQPMIKKSRKQFVPDELKDDKYWARRRKNNIAAKRSRDARRQKENQIAMRARYLEKENATLHQEVEQLKQENMDLRARLSKFQDV", "the MEF2A protein (UniProt: A0A9J7IEP5) in Musca domestica (House fly) encodes a protein of 843 amino acids with a molecular weight of 91680 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MATGSTTTNNNNSLNIPPTQYTQIYGNTNTNNNNHNSNNNHNQYANNSSNIYNGNNNNHNNSSSITSSNNSCSNSLTINNNNINSSNSSSVTVTADAATVAIAKDMLQLHHGSALNNNNNNNNNNINDGLNSPAHNNNNSNNNNNNSSSNSATINNRNSNTMTLATPPAPQQQQQQQQQHPQPPQQQMQLQQQQRPPPPPEHAVGFLKYEDELLYITETCTVIGRNSSTSHVHFHVAENNLVSRKHFQVLFDPETRDFYVQCLSKNGIFVDDFLQRRNADHLKLPASCYFRFPSTEIRIQFESFLHTDSSPPDSLAGSHNNMSNSSMNNNHHNISSSSSSASSHHILSGHGGGSSGGGGGGGGGSISASNVHQVIISPASADELNNQQHQQHHPHHQQQLHGGHTTGHQMQHVTSQQQQHQHHATSAGGGGSGGGVASHLLPVDNSNVIYSPLKIAIPKKEQKSPYLSPTGTISAANSCPASPRQGFHQNQNNYNNYSNNNIQNVSDLTSLTELILPILIISQFSSLQQQDLFQTPSTASYNHNEKPPYSYAQLIVQAISAAPDKQLTLSGIYSFIVKHYPYYRKETNKGWQNSIRHNLSLNRYFIKVARSQDEPGKGSFWRIDPDSGAKLIDHSYKKRRQRSSQGLRPPYGMPRSAPVSPSHMEEYSADNSRESSPLQDIVLQSAPGSPGMSLENRNVDNEIVYQNQNIQQFGTNNAHQYSSPYITNQNQVITQQQQQHHQEVVASSGGGGGGGGGGVGALIALKRNHAMAAAGTNAVVIGGGGGGNTAITLQQQQQQQQPNLQGLHPDIIYEEMPTDYSGNIVESGDECDAGTKRPKVEVL", "the MEF2A protein (UniProt: A0A9J7IFU3) in Musca domestica (House fly) encodes a protein of 833 amino acids with a molecular weight of 90537 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MATGSTTTNNNNSLNIPPTQYTQIYGNTNTNNNNHNSNNNHNQYANNSSNIYNGNNNNHNNSSSITSSNNSCSNSLTINNNNINSSNSSSVTVTADAATVAIAKDMLQLHHGSALNNNNNNNNNNINDGLNSPAHNNNNSNNNNNNSSSNSATINNRNSNTMTLATPPAPQQQQQQQQQHPQPPQQQMQLQQQQRPPPPPEHAVGFLKYEDELLYITETCTVIGRNSSTSHVHFHVAENNLVSRKHFQVLFDPETRDFYVQCLSKNGIFVDDFLQRRNADHLKLPASCYFRFPSTEIRIQFESFLHTDSSPPDSLAGSHNNMSNSSMNNNHHNISSSSSSASSHHILSGHGGGSSGGGGGGGGGSISASNVHQVIISPASADELNNQQHQQHHPHHQQQLHGGHTTGHQMQHVTSQQQQHQHHATSAGGGGSGGGVASHLLPVDNSNVIYSPLKIAIPKKEQKSPYLSPTGTISAANSCPASPRQGFHQNQNNYNNYSNNNIQNVSDLTSLTELILPILIISQFSSLQQQDLFQTPSTASYNHNEKPPYSYAQLIVQAISAAPDKQLTLSGIYSFIVKHYPYYRKETNKGWQNSIRHNLSLNRYFIKVARSQDEPGKGSFWRIDPDSGAKLIDHSYKKRRQRSSQGLRPPYGMPRSAPVSPSHMEEYSADNSRESSPLQDIVLQSAPGSPEIVYQNQNIQQFGTNNAHQYSSSPYITNQNQVITQQQQQHHQEVVASSGGGGGGGGGGVGALIALKRNHAMAAAGTNAVVIGGGGGGNTAITLQQQQQQQQPNLQGLHPDIIYEEMPTDYSGNIVESGDECDAGTKRPKVEVL", "the MEF2A protein (UniProt: A0A6P8JR31) in Drosophila mauritiana (Fruit fly) encodes a protein of 560 amino acids with a molecular weight of 62026 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MRMDYQMPPPALALQQQQQQHGMQHQQQQLQLLQNVQQQQQQQQQQHQQQQLLGNMSQTAALPPLSSLPLQVVHNLPHLLAGNSGGNNANNSNTSNSNLNVACNNNLLRGNMQHQQQQQQQQLLNNLSNGNNVASGTLPPPTQLLQHHLQHLAHVNVNAAAAVVAVAANNLQQQQQQQQHASSNNVTGGSPGSNSNNNNNNILNHNNLNIIINNHASLNNNNNSNNNNNNNNNPATPNANLAASNNATPTVNTASAVAQQQQAHENSLVNSLVGVINNSNNNNNNNTNSNSNNNNNNAVGGDDNNRWTQFQVQQLWKQHANYLNGKSTSNSKEIICPDDKYKEEGDIWNVEAQTAFLGPNLWDKTLPYDADLKVTQYADLDEFLSENNIPDGLPGTHLGHSSGLGHRSDSLGHAAGLSLGLGHITTKRERSPSPSDCISPDTLNPPSPAESTFSFASSGRDFDPRTRAFSDEELKPQPMIKKSRKQFVPDELKDDKYWARRRKNNIAAKRSRDARRQKENQIAMRARYLEKENATLHQEVEQLKQENMDLRARLSKFQDV", "the MEF2A protein (UniProt: A0A9J7DH70) in Musca domestica (House fly) encodes a protein of 832 amino acids with a molecular weight of 90450 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MATGSTTTNNNNSLNIPPTQYTQIYGNTNTNNNNHNSNNNHNQYANNSSNIYNGNNNNHNNSSSITSSNNSCSNSLTINNNNINSSNSSSVTVTADAATVAIAKDMLQLHHGSALNNNNNNNNNNINDGLNSPAHNNNNSNNNNNNSSSNSATINNRNSNTMTLATPPAPQQQQQQQQQHPQPPQQQMQLQQQQRPPPPPEHAVGFLKYEDELLYITETCTVIGRNSSTSHVHFHVAENNLVSRKHFQVLFDPETRDFYVQCLSKNGIFVDDFLQRRNADHLKLPASCYFRFPSTEIRIQFESFLHTDSSPPDSLAGSHNNMSNSSMNNNHHNISSSSSSASSHHILSGHGGGSSGGGGGGGGGSISASNVHQVIISPASADELNNQQHQQHHPHHQQQLHGGHTTGHQMQHVTSQQQQHQHHATSAGGGGSGGGVASHLLPVDNSNVIYSPLKIAIPKKEQKSPYLSPTGTISAANSCPASPRQGFHQNQNNYNNYSNNNIQNVSDLTSLTELILPILIISQFSSLQQQDLFQTPSTASYNHNEKPPYSYAQLIVQAISAAPDKQLTLSGIYSFIVKHYPYYRKETNKGWQNSIRHNLSLNRYFIKVARSQDEPGKGSFWRIDPDSGAKLIDHSYKKRRQRSSQGLRPPYGMPRSAPVSPSHMEEYSADNSRESSPLQDIVLQSAPGSPEIVYQNQNIQQFGTNNAHQYSSPYITNQNQVITQQQQQHHQEVVASSGGGGGGGGGGVGALIALKRNHAMAAAGTNAVVIGGGGGGNTAITLQQQQQQQQPNLQGLHPDIIYEEMPTDYSGNIVESGDECDAGTKRPKVEVL", "the MEF2A protein (UniProt: A0A6I8WAQ4) in Drosophila pseudoobscura pseudoobscura (Fruit fly) encodes a protein of 670 amino acids with a molecular weight of 71771 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MSSDTNSCASFFAQEHTNATLSQYFQQLNSQVAAAAAVASGGAPSSNNNNNNSSSSSGNNSSGNSDSGNDGSLTGSTGTLDNHRSSVSSNDSGKSSAEGAGGGGGASGSGSTSGVNAWALQQQQQTAALHHHQQQQQQQQHLQQQQQAHAHQQHQQHTHHAQQHAAAQQQQHQHHPHGPPHSHPAHPHPHSHQHPHPHHTHPQQQQQQQQQQHHHHQQQQQQHAQQQQHHAAQLAHTLSSAAAAPAPNNNNSGSGSGSTHSIFGTGNFHYKSNNSWTLPTLTYQRLYQENPHYQRSAFMDPQGNGAAAAAAAVAAAGCNVAAAAAAAAANAAGGGQAVVNASSNSSSSNTPSAGALNPNSNVVASQNSSNSNNNSSSNPNTNTNVSSVDHVANAVAAAVIANEHQNHLNSLKARFQPSSSGRKSPFLGFICKANGKSTSNSKEIICPDDKYKEEGDIWNVEAQTAFLGPNLWDKTLPYDADLKVTQYADLDEFLSENNIPDGLPGTHLGHSSGLGHRSDSLSHAAGLSLGLGHITTKRERSPSPSDCISPDTLNPPSPAESTFSFASSGRDFDPRTRAFSDEELKPQPMIKKSRKQFVPDELKDDKYWARRRKNNIAAKRSRDARRQKENQIAMRARYLEKENATLHQEVEQLKQENMDLRARLSKFQDV", "the MEF2A protein (UniProt: A0A6P8X5J3) in Drosophila albomicans (Fruit fly) encodes a protein of 591 amino acids with a molecular weight of 65127 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MRMDYQMPPPALALQQQQQQHQQQQQQQQSHNAALQHQQNQLQMLQQQQQHQQQQQQQMLGNMSQATTLPPLSSLPLQVVHNLPHLLAGNGNNSNNNSSNNNNNNTNLNGNNVGVVACNNNNNNNSQASNNLLRNSMQHQLLSNLSNNSNGNNVAAGNGSHVANGALPPPTQLLQHHLQHLAHVNVNAAAAVVAVAANNLSNNLQHSNNGNNSAANNNNNSANNNNNTILNHNNLNIIINNHTNNNNSSNSNNNNNNNNPATPNANLATATPTVNSAASAVAQQQQAHENSLVNSLVGVINGNSNNSNNNNNNNTSNNANSNNANNGDDNNRWTQFQVQQLWKQHANYLNGKSTSNSKEIICPDDKYKEEGDIWNVEAQTAFLGPNLWDKTLPYDADLKVTQYADLDEFLSENNIPDGLPGTHLGHSGGLGHRSDSLSHAAGLSLGLGHITTKRERSPSPSDCISPDTLNPPSPAESIFDIPAFSFASSGRDFDPRTRAFSDEELKPQPMIKKSRKQFVPDELKDDKYWARRRKNNIAAKRSRDARRQKENQIAMRARYLEKENATLHQEVEQLKQENMDLRARLSKFQDV", "the MEF2A protein (UniProt: A0A6P8JS87) in Drosophila mauritiana (Fruit fly) encodes a protein of 571 amino acids with a molecular weight of 63233 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MRMDYQMPPPALALQQQQQQHGMQHQQQQLQLLQNVQQQQQQQQQQHQQQQLLGNMSQTAALPPLSSLPLQVVHNLPHLLAGNSGGNNANNSNTSNSNLNVACNNNLLRGNMQHQQQQQQQQLLNNLSNGNNVASGTLPPPTQLLQHHLQHLAHVNVNAAAAVVAVAANNLQQQQQQQQHASSNNVTGGSPGSNSNNNNNNILNHNNLNIIINNHASLNNNNNSNNNNNNNNNPATPNANLAASNNATPTVNTASAVAQQQQAHENSLVNSLVGVINNSNNNNNNNTNSNSNNNNNNAVGGDDNNRWTQFQVQQLWKQHANYLNGRKSPFLGFICKSNGKSTSNSKEIICPDDKYKEEGDIWNVEAQTAFLGPNLWDKTLPYDADLKYADLDEFLSENNIPDGLPGTHLGHSSGLGHRSDSLGHAAGLSLGLGHITTKRERSPSPSDCISPDTLNPPSPAESTFSFASSGRDFDPRTRAFSDEELKPQPMIKKSRKQFVPDELKDDKYWARRRKNNIAAKRSRDARRQKENQIAMRARYLEKENATLHQEVEQLKQENMDLRARLSKFQDV", "the MEF2A protein (UniProt: A0A9J7DKU8) in Musca domestica (House fly) encodes a protein of 844 amino acids with a molecular weight of 91767 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MATGSTTTNNNNSLNIPPTQYTQIYGNTNTNNNNHNSNNNHNQYANNSSNIYNGNNNNHNNSSSITSSNNSCSNSLTINNNNINSSNSSSVTVTADAATVAIAKDMLQLHHGSALNNNNNNNNNNINDGLNSPAHNNNNSNNNNNNSSSNSATINNRNSNTMTLATPPAPQQQQQQQQQHPQPPQQQMQLQQQQRPPPPPEHAVGFLKYEDELLYITETCTVIGRNSSTSHVHFHVAENNLVSRKHFQVLFDPETRDFYVQCLSKNGIFVDDFLQRRNADHLKLPASCYFRFPSTEIRIQFESFLHTDSSPPDSLAGSHNNMSNSSMNNNHHNISSSSSSASSHHILSGHGGGSSGGGGGGGGGSISASNVHQVIISPASADELNNQQHQQHHPHHQQQLHGGHTTGHQMQHVTSQQQQHQHHATSAGGGGSGGGVASHLLPVDNSNVIYSPLKIAIPKKEQKSPYLSPTGTISAANSCPASPRQGFHQNQNNYNNYSNNNIQNVSDLTSLTELILPILIISQFSSLQQQDLFQTPSTASYNHNEKPPYSYAQLIVQAISAAPDKQLTLSGIYSFIVKHYPYYRKETNKGWQNSIRHNLSLNRYFIKVARSQDEPGKGSFWRIDPDSGAKLIDHSYKKRRQRSSQGLRPPYGMPRSAPVSPSHMEEYSADNSRESSPLQDIVLQSAPGSPGMSLENRNVDNEIVYQNQNIQQFGTNNAHQYSSSPYITNQNQVITQQQQQHHQEVVASSGGGGGGGGGGVGALIALKRNHAMAAAGTNAVVIGGGGGGNTAITLQQQQQQQQPNLQGLHPDIIYEEMPTDYSGNIVESGDECDAGTKRPKVEVL", "the MEF2A protein (UniProt: A0A2J8VXR4) in Pongo abelii (Sumatran orangutan) encodes a protein of 496 amino acids with a molecular weight of 53495 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQITRIMDERNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNKLFQYASTDMDKVLLKYTEYNEPHESRTNSDIVEALNKKEHRGCDSPDPDTSYVLTPHTEEKYKKINEEFDNMMRNHKIAPGLPPQNFSMSVTVPVTSPNALSYTNPGSSLVSPSLAASSTLTDSSMLSPPQTTLHRNVSPGAPQRPPSTGNAGGMLSTTDLTVPNGAGSSPVGNGFVNSRASPNLIGATGANSLGKVMPTKSPPPPGGGNLGMNSRKPDLRVVIPPSSKGMMPPLNTQRISSSQATQPLATPVVSVTTPSLPPQGLVYSAMPTAYNTDYSLTSADLSALQGFNSPGMLSLGQVSAWQQHHLGQAALSSLVAGGQLSQGSNLSINTNQNINIKSEPISPPRDRMTPSGFQQQQQQQQQPPPPPPQPQPPQPQPRQEMGRSPVDSLSSSSSSYDGSDREDPRGDFHSPIVLGRPPNTEDRESPSVKRMRMDAWVT", "the MEF2A protein (UniProt: L0R504) in Homo sapiens (Human) encodes a protein of 54 amino acids with a molecular weight of 6125 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MYVGVSVYVWVCVTYTESGTYLQTPCRSADVCPMADKAPCRHRQVWHFLGLLVS", "the MEF2B gene (UniProt: Q02080) in Homo sapiens (Human) encodes a gene of 365 amino acids with a molecular weight of 38639 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLNTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPPVGAEAWARRVPQPAAPPRRPPQSASSLSASLRPPGAPATFLRPSPIPCSSPGPWQSLCGLGPPCAGCPWPTAGPGRRSPGGTSPERSPGTARARGDPTSLQASSEKTQQ", "the MEF2B gene (UniProt: O55087) in Mus musculus (Mouse) encodes a gene of 349 amino acids with a molecular weight of 37435 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCDIALIIFNSAQRLFQYASSDMDRVLLKYTEYSEPHESRTNADILQTLKRRGVGLDGPELDMEEGPEGPGEKLLRTLGGDRGSASPRPRIYPVAPAMSVSELSYRVPPATPGCDPGGLGEVPSVHSRPAYFRPPGLGHPIFSPSHLASKTPPPLYLATDGRRPDLPPGLVGARGGLGTSRSLYSGLQSPGAPGPALGSFAFLPSGSTDCSPGDAAQGPLQPSPWPPTRDAVDPARPVARSLCKEGPPSRGASPPTPPVSIKSERLSPVTGTSGDFPRSFPYPLLLARPLAEPLRPSASLHRLTPDSWPR", "the MEF2B gene (UniProt: Q6AXR7) in Rattus norvegicus (Rat) encodes a gene of 348 amino acids with a molecular weight of 37251 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCDIALIIFNSAQRLFQYASSDMDRVLLKYTEYSEPHESRTNADILQTLKRRGVGLDGPELDMEEGPEGPGEKLLRTLGGDRGLVSPPPRIYPVAPAMSVSELSYRVPPATSGCDPGGLGEAPSVHSRSPHFRPPGLGHPIFSPSHLAGKTPPPLYLATDGRRPDLPPGLVGARGGLGTSRSLYSGLQSPGAPGPALGSFAFLPPGSADCSPGDAAQVPLQPSPWPPTRDAVDPAGPAARSLCEEGPPSREASPPTPPVSIKSERLSPVTGTSGDFPRSFPYPLLLARPLAEPLRPASLRRLTPDSWPR", "the MEF2B gene (UniProt: J7HE56) in Danio rerio (Zebrafish) encodes a gene of 420 amino acids with a molecular weight of 46078 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNTDILETLRRKGLGLESSEIDPEDGVTMGAEKYHDGMDLSLARQRYYAPSLLHSEVINTSAENGYINSSNPNLGAHRTPSYKPLCTRPGSTGTVSANSHPALMGPHAGLGYSMFPHGSLSRALEMKTPPPLNMSSDGRRVEAHAGLCGTRSSLANAVRESTKRALYQSMHAGGHMMAMGKTGLLGHGLNYSPSEYSHPGYTVGFQRSSMNTWQPLTHQDAHQSMISPGMASGGSCSYPSQSSSPSSPSHPSLNLSIKSERTSPVHMISPTPPSHHMLQHSPIAEPKSSSCPPSDEYADLQREEAQKSSFSGQQQGPNRDPPETKSSPNPKQQDISNGWIR", "the MEF2B gene (UniProt: B3KQ23) in Homo sapiens (Human) encodes a gene of 297 amino acids with a molecular weight of 31823 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILEVPQTLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLNTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPPEYGLGDPPPPPGLLQPPTLAPWQPSRGDGPPAVSSQPR", "the MEF2B gene (UniProt: B8ZZJ5) in Homo sapiens (Human) encodes a gene of 286 amino acids with a molecular weight of 31171 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPEKPLQWPAEPLLHCNSRTPTGELPLPPRRPPSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPALRRLPLADGWPR", "the MEF2B gene (UniProt: C9J4J4) in Homo sapiens (Human) encodes a gene of 375 amino acids with a molecular weight of 39810 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLNTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPPAPNSCPPEYGLGDPPPPPGLLQPPTLAPWQPSRGDGPPAVSSQPSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPALRRLPLADGWPR", "the MEF2B gene (UniProt: A0A1D5QKX1) in Macaca mulatta (Rhesus macaque) encodes a gene of 490 amino acids with a molecular weight of 52473 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MEEPEMQLKGKKVTDKFTESVYVLANEPSVALYRLQEHVRRSLPELAQHKRREEPGGQQRLLPQRGGSAQTGHQHPGPYECQCAGSQPGGTTPALLSLILEETQGTPASTNPDGDRSTQPGTMGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPEMEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDMVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRPDLPGGLAGPRGALNTSRSLYSGLQSPCSTATPGPPLGSFPFLPAGPAEYGLGDPPPPPGLLQPPTLAPWQPSRGDGPPAVPSQPSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPALRRLPLADGWPR", "the MEF2B gene (UniProt: A0A8I6GDA6) in Rattus norvegicus (Rat) encodes a gene of 243 amino acids with a molecular weight of 26597 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCDIALIIFNSAQRLFQYASSDMDRVLLKYTEYSEPHESRTNADILQTLKRRGVGLDGPELDMEEGPEGPGEKLLRTLGGDRGLVSPPPRIYPVAPAMSVSELSYRVPPATSGCDPGGLGEAPSVHSRSPHFRPPGLGHPIFSPSHLAGKTPPPLYLATDGRRPDLPPGLVGARGGLGTSIAVRETQLRSPCSPRPGHQRGTRW", "the MEF2B gene (UniProt: A0A8M3AXP2) in Danio rerio (Zebrafish) encodes a gene of 414 amino acids with a molecular weight of 45377 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNTDILETLRRKGLGLESSEIDPEDGVTMGAEKYHDGMDLSLARQRYYAPSLLHSEVINTSAENGYINSSNPNLGAHRTPSYKPLCTRPGSTGTVSANSHPALMGPHAGLGYSMFPHGSLSRALEMKTPPPLNMSSDGRRVEAHAGLCGTRSSLANARALYQSMHAGGHMMAMGKTGLLGHGLNYSPSEYSHPGYTVGFQRSSMNTWQPLTHQDAHQSMISPGMASGGSCSYPSQSSSPSSPSHPSLNLSIKSERTSPVHMISPTPPSHHMLQHSPIAEPKSSSCPPSDEYADLQREEAQKSSFSGQQQGPNRDPPETKSSPNPKQQDISNGWIR", "the MEF2B gene (UniProt: K7N7F1) in Mus musculus (Mouse) encodes a gene of 349 amino acids with a molecular weight of 37348 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCDIALIIFNSAQRLFQYASSDMDRVLLKYTEYSEPHESRTNADILQTLKRRGVGLDGPELDMEEGPEGPGEKLLRTLGGDRGSASPPPRIYPVAPAMSVSELSYRVPPATPGCDPGGLGEAPSVHSRPPHFRPPGLGHPIFSPSHLASKTPPPLYLATDGRRPDLPPGLVGARGGLGTSRSLYSGLQSPGAPGPALGSFAFLPSGSTDCSPGDAAQGPLQPSPWPPTRDAVDPARPVARSLCKEGPPSRGASPPTPPVSIKSERLSPVTGTSGDFPRSFPYPLLLARPLAEPLRPSASLHRLTPDSWPR", "the MEF2B gene (UniProt: A0A8M2BHT0) in Danio rerio (Zebrafish) encodes a gene of 128 amino acids with a molecular weight of 14695 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MEDQEMQLKVKRVTDKFTESMYVLANEPSIALYRLQEHVRRSLPELVQHKTDMQSWEEQSQGAIYTVEYACSAVKSMTNSSLYFKNIDGLLRQAISLKEQISSSQGRRKRALDHGMHKDGGEKHSSGM", "the MEF2B gene (UniProt: F2Z4G1) in Bos taurus (Bovine) encodes a gene of 368 amino acids with a molecular weight of 38897 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSSNRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGVGLDGPELEPDEGLEGPGEKLRRLAGDGGDPALPRPRLYPAAPTMPSPDMVYGALPPPACEPTGLGEALPAQSRPSPFRPAAPKAGPPGLAHPLFSPSHLASKTPPPLYLAADGRRPDLPGGLAGTRGGLSSSRGLYGGLQSPCSTAAPGPPLGSFPFLPAGPPEYGLGDPPPPPGLLQPPTLAPWQPSRADGPPATPTQPSGGRSLGEDGPPARGASSPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARPLAEPLRPGPPLRRLPTADGWPR", "the MEF2B gene (UniProt: F7EZT3) in Rattus norvegicus (Rat) encodes a gene of 355 amino acids with a molecular weight of 37770 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCDIALIIFNSAQRLFQYASSDMDRVLLKYTEYSEPHESRTNADILQTLKRRGVGLDGPELDMEEGPEGPGEKLLRTLGGDRGLVSPPPRIYPVAPAMSVSELSYRVPPATSGCDPGGLGEAPSVHSRSPHFRPPGLGHPIFSPSHLAGKTPPPLYLATDGRRPDLPPGLVGARGGLGTSRSLYSGLQSPGAPGPALGSFAFLPPGSAASARRLQSGRRSSGPPAALALATNEGRGGPRRASCPQSVRGGSPEPRGLPSDTSGQHQIRTSVSSHWDLWRLPQVLPLPSAPCQTPGRATAARVPAPLDSRQLATVAL", "the MEF2B gene (UniProt: A0A1C7ND04) in Choanephora cucurbitarum () encodes a gene of 399 amino acids with a molecular weight of 45137 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQIQPIKDDRNRQVTFLKRKHGLMKKAYELSVLCNCEVALVIFPPNNKLIQYSSSDMDKLLKQYEENELPREVRTNQDFIENSEGRQDDDQESQVSSDHDPSEKAEKATSTVTHQLLPQPTQPNLMYPQQHPSLMPQQQQPQQRVLATQTTQLVPTQVSMPYTPQSTSYTMYQPSVTPHQHQFLRHANGSLTSPLSATSSVSSFDPNTMYQQNHLFLMQQQQQQIAHSVVYQQQQHMPSLYHSPYSSPTTVQQEFSPDQSPLSEPGTPEKRPKLRVTIPVNDNDVGSTINKNYSPSLLQTNVVNTTGLIPPPSSLPSQYVTNLPSPSAFYPEFYPANMMMSPIQQMNSASSFVIPTAPFKEGSGTTRLDNDASGKRAYMPFDYMPTNKKIKTEA", "the MEF2B gene (UniProt: A0A218UC21) in Lonchura striata domestica (Bengalese finch) encodes a gene of 302 amino acids with a molecular weight of 32738 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MQSWEEQSQGAIYTVEYACSAVRSMADSSVCFRSIDSLLRNSIATRERLGSHFLACEWRRSNLVCWTPNPAEEAKMGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDKVLLKYTEYSEPHESRTNSDILQSPVPLPEAAHGSSPPAAEASLGSGSSPQGRGRSPAARAAAPKPPGRAGSRIVPAEEPAAVPGASPQRQAISIKSERVSPGLGCPPGTPQPPLASLATLSEASRAPGDLQPRDDFAKGFPPYAPGPLPLPARRGAPVDVWQR", "the MEF2B gene (UniProt: A0A2I3LNM2) in Papio anubis (Olive baboon) encodes a gene of 286 amino acids with a molecular weight of 31181 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPEMEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDMVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPEKPLQWPAEPLLHCNPWTPAGELPLPSGRPRSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPALRRLPLADGWPR", "the MEF2B gene (UniProt: A0A2J8T5J0) in Pongo abelii (Sumatran orangutan) encodes a gene of 375 amino acids with a molecular weight of 39849 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLNTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPPAPNSCPPEYGLGDPPPPPGLLQPPTLAPWQPSRGDGPPAVPSQPSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPVLRRLPLADGWPR", "the MEF2B gene (UniProt: A0A2K5C9I0) in Aotus nancymaae (Ma's night monkey) encodes a gene of 375 amino acids with a molecular weight of 39775 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRMAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLAHPLFSPSHLTSKTPPPLYLSADGRRPDLPGGLAGPRGGINTSRSLYSGLQSPCSSAAPGPPLGSFPFLPAGPPAPNSRPPEYGLGDPPPPPGLLQPPTLASWQPSRGDGPPAMPSQPSGGRSLGEEGPPPHGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPAPALRRLPLADGWPR", "the MEF2B gene (UniProt: A0A2K6DJ63) in Macaca nemestrina (Pig-tailed macaque) encodes a gene of 388 amino acids with a molecular weight of 41090 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPEMEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDMVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPVGWGWGPGGLFGCILALALPDCVHLTSKTPPPLYLPTDGRRPDLPGGLAGPRGALNTSRSLYSGLQSPCSTATPGPPLGSFPFLPAGPAAPNSCPPEYGLGDPPPPPGLLQPPTLAPWQPSRGDGPPAVPSQPSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPALRRLPLADGWPR", "the MEF2B gene (UniProt: A0A2K6GD45) in Propithecus coquereli (Coquerel's sifaka) encodes a gene of 367 amino acids with a molecular weight of 38743 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGVGLDGPELEPDEGPEGPGEKLRRLAGEGGDPALPRPRLYPATPAMPSPDMVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLAHPLFSPNHLTSKTPPPLYLAADGRRPDLPGGLAGPRGGLNSRSLYGSLQSPCSAAAPGTPLGSFPFLPAGPPEYGLGDPPPPPGLLQSPTLAPWQSSRGDGPPAAPAPPSGGRSLGEEGPPTRGASPPTPAVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPALRRLPLADGWPR", "the MEF2B gene (UniProt: A0A2K6LUS1) in Rhinopithecus bieti (Black snub-nosed monkey) encodes a gene of 286 amino acids with a molecular weight of 31288 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLGGEGGDPALPRPRLYPAAPAMPSPDMVYGALPPPSCDPSGLGEALPAQSRPSPFRPAAPKAGPPEKPLQWPAEPLLHCNPWTPAGELPLPPRRPRSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPALRRLPLADGWPR", "the MEF2B gene (UniProt: A0A2K6T7P7) in Saimiri boliviensis boliviensis (Bolivian squirrel monkey) encodes a gene of 268 amino acids with a molecular weight of 28724 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is VTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEAPPAQSRPSPFRPAAPKAGPPEKPLQWPPEPLLHCSPGTPAGELPLPPGRPPSGGRSLGEEGPPTHSASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPALRRLPLADGWPR", "the MEF2B gene (UniProt: A0A2R9A792) in Pan paniscus (Pygmy chimpanzee) encodes a gene of 286 amino acids with a molecular weight of 31199 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVIYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPEKPLQWPAESLLHCNPRTPTGELPLPPRRPPSGGRSLGEEGPPTRGASPPTPPISIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPALRRLPLADGWPR", "the MEF2B gene (UniProt: A0A8B7EPD9) in Microcebus murinus (Gray mouse lemur) encodes a gene of 377 amino acids with a molecular weight of 39081 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the gene sequence is MGPIWELAASATTPQILFSPSRLRLRSGAQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILQTLKRRGVGLEGPELEPDEGPEGPGEKLQRLAGEGGDPALPRPRLYPATPAMPSPDMVYGAFPPAGCDPGGLGEALPAQSRPSPFRPAAPKAGPPGLAHPLFSPNHLASKTPPPLYLAADGRRPDLPGGLAGARGGLSSSRSLYGSLQSPCSAAAPGTPLGSFPFLPAGAPEYGLGDPPPPPGLLQSPALAAWPSSRGDAPPAAAAPPSGGRGPGEGGPPTSPPPPAVSVKSERVSPAPGGAGDFPAAFPYPLLLARTLAEPLRPAPALRRLPLADGWPR", "the MEF2B protein (UniProt: Q96FH0) in Homo sapiens (Human) encodes a protein of 119 amino acids with a molecular weight of 13403 Daltons. Found in the UniProt database as UniProtKB reviewed (Swiss-Prot), the protein sequence is MEEPEMQLKGKKVTDKFTESVYVLANEPSVALYRLQEHVRRSLPELAQHKADMQRWEEQSQGAIYTVEYACSAVKNLVDSSVYFRSVEGLLKQAISIRDHMNASAQGHSPEEPPPPSSA", "the MEF2B protein (UniProt: H3BNR1) in Homo sapiens (Human) encodes a protein of 382 amino acids with a molecular weight of 40459 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MPVPRATDKDHSTQPGTMGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLNTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPPVGAEAWARRVPQPAAPPRRPPQSASSLSASLRPPGAPATFLRPSPIPCSSPGPWQSLCGLGPPCAGCPWPTAGPGRRSPGGTSPERSPGTARARGDPTSLQASSEKTQQ", "the MEF2B protein (UniProt: A2T7D3) in Pan troglodytes (Chimpanzee) encodes a protein of 238 amino acids with a molecular weight of 25337 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is VTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLSTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPP", "the MEF2B protein (UniProt: A0A8X8BMY2) in Polypterus senegalus (Senegal bichir) encodes a protein of 445 amino acids with a molecular weight of 47905 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MQEKILSGAKCGKVGFTRDYSHAITLVGIVPCVWPAVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNTDILETLRRKGLGLDSPDIDPEDTVTMTTEKYREMNEGIDLSLSRQRYYGPPLLLPEAQYLVSGACENGFPNSNMGGSLHSSHRPAPFKPVPPKVAHHGGNSPQAPNAGVGYSMFSHANLNRVLDMKTSSHASLGADSRRAEVHAALAGTRANLGAVRALYPGMHPGSQGMTMTKAGLSGHGLGGYTLAAAGPPEYPHSGFAQSVTLQRNAVSPWQQMHPQDVPSLANGSHGILGGNSSGSSFPGQNLEPTSSSSPHPAAMNTNIKSERLSPVSSCSPTTTTQRLTSRPSPAGTSDHTSTGEPYPAREREDFQKGGFSCPLVLAPRPVSEDKGGLRRIETTESWHR", "the MEF2B protein (UniProt: A0A2J8T5I8) in Pongo abelii (Sumatran orangutan) encodes a protein of 297 amino acids with a molecular weight of 31861 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILEVPRTLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLNTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPPEYGLGDPPPPPGLLQPPTLAPWQPSRGDGPPAVPSQPR", "the MEF2B protein (UniProt: A0A2J8T5K4) in Pongo abelii (Sumatran orangutan) encodes a protein of 368 amino acids with a molecular weight of 39182 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLNTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPPEYGLGDPPPPPGLLQPPTLAPWQPSRGDGPPAVPSQPSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPVLRRLPLADGWPR", "the MEF2B protein (UniProt: A0A2J8T5J0) in Pongo abelii (Sumatran orangutan) encodes a protein of 375 amino acids with a molecular weight of 39849 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLNTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPPAPNSCPPEYGLGDPPPPPGLLQPPTLAPWQPSRGDGPPAVPSQPSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPVLRRLPLADGWPR", "the MEF2B protein (UniProt: A0A2J8T5H8) in Pongo abelii (Sumatran orangutan) encodes a protein of 286 amino acids with a molecular weight of 31179 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSANRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVVYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPEKPLQWPAEPLLHCNPRTPAGELPLPPRRPPSGGRSLGEEGPPTRGASPPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARSLAEPLRPGPVLRRLPLADGWPR", "the MEF2B protein (UniProt: A1YFA3) in Gorilla gorilla (western gorilla) encodes a protein of 18 amino acids with a molecular weight of 2241 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQ", "the MEF2B protein (UniProt: A0A212D1I4) in Cervus elaphus hippelaphus (European red deer) encodes a protein of 340 amino acids with a molecular weight of 35482 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MKKAYELSVLCDCEIALIIFNSSNRLFQYASTDMDRVLLKYTEYSEPHESRTNTDILETLKRRGVGLDGPELEPDEGLEGPGEKLRRLAGDGGDPALPRPRLYPAAPTMPSPDIVYGALPPPACEPTGLGEALPAQSRPSPFRPAAPKAGPPGLAHPLFSPSHLASKTPPPLYLAADGRRPDLPGGLAGTRGGLSSSRGLYGGLQSPCSTAAPGTPLGSFPFLPAGPPEYGLGDPPPPPGLLQPPTLAPWQPSRADGPPATPTQPSGGRSLGEDGPPARGASSPTPPVSIKSERLSPAPGGPGDFPKTFPYPLLLARPLAEPLRPGPPLRRLPTADGWPR", "the MEF2B protein (UniProt: A1YFA4) in Gorilla gorilla (western gorilla) encodes a protein of 279 amino acids with a molecular weight of 28422 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is TLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDVIYGALPPPGCDPSGLGEALPAQSRPSPFRPAAPKAGPPGLVHPLFSPSHLTSKTPPPLYLPTEGRRSDLPGGLAGPRGGLNTSRSLYSGLQNPCSTATPGPPLGSFPFLPGGPPVGAEAWARRVPQPAAPPRRPPQSASSPSASLRPPGAPATFLRPSPTPCSSPGPWQSLCGLGPPCAGCPWPTAGPGRRSAGGTSPERSPGTARARGDPTSLQASSEKTQQ", "the MEF2B protein (UniProt: A1YFU1) in Saguinus labiatus (Red-chested mustached tamarin) encodes a protein of 139 amino acids with a molecular weight of 14319 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is TLKRRGIGLDGPELEPDEGPEEPGEKFRRLAGEGGDPALPRPRLYPAAPAMPSPDIVYGALPPPGRDPSGLGEALPAQSRPSPFRPAAPKAGPPGLAHPLFSPSHLTSKTPPPLYLPADGRRPDLPGGLAGPRGGLNTS", "the MEF2B protein (UniProt: A0A3L8QB93) in Chloebia gouldiae (Gouldian finch) encodes a protein of 170 amino acids with a molecular weight of 17641 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is RPLYPALQTLSPVLSPGSSGLPSHGLAGFPFLSPAQADFGAGEVPPPPGFLQPPAWQHPRDMAALGASSRIVPAEEPAAVPGASPQRQAISIKSERVSPGLGCPPGTPQPSLASLATLSEASRAPGDLQPRDDFAKGFPPFAPGPPRPLPDEQRVPVPPRRGQPVDAWQR", "the MEF2B protein (UniProt: A0A7K4WWR1) in Tachuris rubrigastra () encodes a protein of 406 amino acids with a molecular weight of 43060 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNSDILETLKRKGLGLESHELELDEGPEPGDKGRRPSEGVDLSVARPRFYAAYGSSPPATDTSLGSASSSPQSQGRSPAFKPAAPKPPGRCPGPLPPGLGYPLFPAGSLTRALATKTPPPLYLGAEGRRGEAQGSLASGRGGGTARPLYPALQTLSPVLAPGSSSIPSHGLAGFPFLSPAQADFGAAEVPPPPGFLQPSPPAWQHPRDVAALGPGLTLLPSCPRVSGRIVSAEDPPPAPGSSPHHQAISIKSERVSPGLGCPPGTPQPPLASLASLSEASRGSGDLQPRDDYAKGFPYPLGAPRPPVEEQRVPVPPRRAQPVDVWQR", "the MEF2B protein (UniProt: A0A7K5A1K9) in Centropus unirufus () encodes a protein of 406 amino acids with a molecular weight of 43527 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNSDILETLKRKGLGLESQELELDEGPDPAEKTQRLSEGMDLSVARPRFCAAYGSSSSAPDTSLGSTSASPQGQGRLPPFKPAAPKPPGRSPGPLPPGIGYPVFPTTSLNRALATKTSPPLYLGAEGRRGEAHGSLVGSRSGGSSARPLYPTLQTLSPVLSPGSSSVPGHSLGSFSFLAPAQAEFGAGEAPQPPGFLQPSPAVWQPQRDVAALGLTPPPLLLPRVSSRIVPTEEPPLPPGTSPQHQGISIKSERVSPGLGCPSGTPQPPLTSLTSLSEASRSPGDLEPRDDYAKGYPYPLPAPRLLAEEQRAPVPPRRAQTMDTWQR", "the MEF2B protein (UniProt: A0A7K6J344) in Machaerirhynchus nigripectus () encodes a protein of 254 amino acids with a molecular weight of 27072 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNSDILETLKRKGLGLESHELELEEGPEPPGDRAGRGLGDGVDLSLARPRFYVSRCSPPATDSSLGSAGSSPQGQGRSPAFKPAAPKPPGRSPGPLPPGLSYPLFPAASLSRALATKTPPPLFLGAEGRRGEAQGSLASGRSSGSAARPLYPALQTLSPVLSPSSSGLPSHGLAG", "the MEF2B protein (UniProt: A0A7K6K6R5) in Oreocharis arfaki (tit berrypecker) encodes a protein of 263 amino acids with a molecular weight of 27999 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNSDILETLKRKGLGLESHELELEEGPEPPGDRGRRLGDGVDLPLARPRFYAAYGSSPPATDSSLGSASSSPQGQGRSPAFKPAPPKAPGRSPGPLPPGLSYPLFPAASLSRALATKTPPPLFLGAEGRRGEAQGGLASGRSGGSAGRPLYPALQTLSPVLSPGSSGLPSHGLAGFPFLSPAQA", "the MEF2B protein (UniProt: A0A7K6W515) in Steatornis caripensis (Oilbird) encodes a protein of 263 amino acids with a molecular weight of 26847 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is YGSSPPTADGSLGSASGSPQGQGRPPAFKPAAPKPPARSPAPLPPGIAYPLFPAGSLNRALATKTPPPLYLGPEGRRGEAHGSSASGRNGGSVARPLYPALQTLSPVLTPGSTGIPSHGLTGFPFLAPAQAEFGAGETPPPPSFLQPGPPAWQHPRDMAALGSRIVPTDEPTPAPGASPQHQAISIKSERVSPGLGCPSGTPQPPLATLASLSEASRGPGDLQQRDDYAKGYLYPLGPPRPLAEEQRAPVPARRAQAVDAWQR", "the MEF2B protein (UniProt: A0A7K7UM36) in Ibidorhyncha struthersii () encodes a protein of 191 amino acids with a molecular weight of 20667 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is QVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNSDILETLKRKGLGLESHELELDEGPDPGEKARRLSEGMDLSVARPRFYAAYGSSPPAADGSLGSASGSPQGQGRPPAFKPSAPKPPGRSPGPLPPGIGYPLFPSGSLNRALATKTPPPLYLGAEGRR", "the MEF2B protein (UniProt: A0A7K7XMD6) in Mohoua ochrocephala () encodes a protein of 288 amino acids with a molecular weight of 30799 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNSDILETLKRKGLGLESHELELEEGPEPPGDRGRRLGDGVDLSLARPRFYAAYGSSPPATDTSLGSAGSSPQGQGRSPAFKPAAPKPPGWSPGPLPPGLSYPLFPAASLSRALATKTPPPLFLGAEGRRGEAQGSLASGRSGGSAARPLYPALQTLSPVLSPGSSGLPSHGLAGFPFLSPAQADFGAGDVPPPPGFLQPPAWQHHRDM", "the MEF2B protein (UniProt: A0A7K8KIA8) in Lophotis ruficrista () encodes a protein of 309 amino acids with a molecular weight of 32466 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDRVLLKYTEYSEPHESRTNSDILEVAAGPAGGYRGGAGPRSAPRSPQTLKRKGLGLESHELELDEGPEPGEKARRPSEGVDLSVARPRFYAPYGSSPPATDASLGGASGSPHGQGRVLTFKPETPKAPGRLPGPLPPGVGYPLFPAGSLTHALATKTSPPLYLGAEGRRGEAHGSLASGRSSGSAGRPLYPALQTLSPALAPGSSSVPSHGLAAFPFLAPAQAGESWPLGPGTARTPPSCGPPPPAQ", "the MEF2B protein (UniProt: A0A7K8LMB0) in Ardeotis kori () encodes a protein of 386 amino acids with a molecular weight of 40722 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDRVLLKYTEYSEPHESRTNSDILETLKRKGLGLESHELELDEGPEPGEKARRPSEGVDLSVARPRFYAPYGSSSPATDTSLGGASGSPHGQGRVLAFKPATPKAPGRSPGPLPPGVGYPLFPAGSLTRALATKTSPPLYLGAEGRRGEAHGSLASGRSGGSAGRPLYPALQTLSPALAPGSSSAPSHSLTAFPFLAPAQAAEFGAGEAPPPPTFLQPGPTAWQHPRDMAALGSRIVPTAEPAPAAATPPQHQAISIKSERVSPGLGCPPGTPQPPLAALSEASRCAGDLQPRDDYAKGYPYPPGPPRPPAEEQRAPGPARRAQA", "the MEF2B protein (UniProt: A0A7K8W5V7) in Sclerurus mexicanus (tawny-throated leaftosser) encodes a protein of 396 amino acids with a molecular weight of 42145 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNSDILETLKRKGLGLESHELELDEGPEPGEKGRRLSEGVDLSVARSRFYATYGSSPPATDTSLGSASSSPQSQGRSPAFKPAAPKPPGRSPGPLPPGLSYPLFPASSLNRALATKTPPPLYLGAEGRRGEAHGSLASGRGAGGTTRPLYPTLQTLSPVLTPGSSSIPSHGLASFSFLSPAQADFGAGEVPPPPGFLQPGPPAWQHPRDTAALGVSGRIVSAEDAPPAPGSSPQHQAISIKSERVSPGLGCPSGTPQPPVASLASLSEASRGPGDLQPRDDYAKGYPYPLGAPRPLAEEQRVPVPTRRAQAMDVWQR", "the MEF2B protein (UniProt: A0A7K9FRY9) in Stercorarius parasiticus (Parasitic jaeger) encodes a protein of 377 amino acids with a molecular weight of 39786 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is QVTFTKRKFGLMKKAYELSVLCDCEIALIIFNHSNKLFQYASTDMDKVLLKYTEYSEPHESRTNSDILETLKRKGLGLESHELELDEGPDPGEKARRLSEGMDLSVARPRFYAAYGSSPPATDGSLSSASGSPQSQGRPPAFKPAAPKPPGRSPGPLPPGIGYPLFPTGSLNRTLATKTPPPLYLGAEGRRSEAHGSLASGRSGGSVARPLYPALQTLSPVLAPGSAGVPSHGLSGFPFLAPAQAEFGAGEAPPPPGFLQPGPAAWQHPRDMAALGSRIVPTEEAAAAPGTSPQHQAISIKSERVSPGLGCPSGTPQPPLASLASLSEASRGPGDLQPRDDYAKGYPYPLGPPRPLAEEQRAPLPARRVQAMDAWQR", "the MEF2B protein (UniProt: A0A7L0DG20) in Rostratula benghalensis (greater painted-snipe) encodes a protein of 395 amino acids with a molecular weight of 42020 Daltons. Found in the UniProt database as UniProtKB unreviewed (TrEMBL), the protein sequence is MGRKKIQISRILDQRNRQVTFTKRKFGLMKKAYELSVLCDCEIALIIFNSTNRLFQYASTDMDKVLLKYTEYSEPHESRTNSDILETLKRKGLGLESQELELDEGPDPGEKARRLGEGMDLSVARPRFYAAYGSSPPATDGSLGSASSSPQGQGRPPTFKPAAPKPPGRSPGPLPPGIGYPLFPTGNLNRALATKTPPPLYLGAEGRRGEAHGSLASGRSGGSAGRPLYPTLQTLSPVLTGSANVPNHSLTGFPFLAPAQTEFGAGEAPPPPGFLQPGPTAWQHPRDMAAVGVGSRSVPTEEPAAAPGASPQHQAISIKSERVSPGLGCPSGTPQPPLASLAPLSEASRGPGDLQPRDDYVKGYPYPLGPPRLLAEEQRGPVPARRAQAMDAWQR", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005634,GO:0005667,GO:0003682,GO:0001228,GO:0003700,GO:0000981,GO:0140297,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0000977,GO:0061629,GO:0043565,GO:0046332,GO:0006915,GO:0061337,GO:0030154,GO:0071277,GO:0048813,GO:0006351,GO:0070375,GO:0007507,GO:0000165,GO:0000002,GO:0048311,GO:0007517,GO:0000122,GO:0010613,GO:0010628,GO:0046326,GO:0045944,GO:0055005", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following reference in the Pharos database: Q02078", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following reference in the Reactome database: R-HSA-198753,R-HSA-525793", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following reference in the KEGG database: hsa:4205", "the MEF2A gene (UniProt: Q02078) in the Homo sapiens (Human) species has the following reference in the AlphaFoldDB database: Q02078", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005634,GO:0005667,GO:0003682,GO:0003677,GO:0001228,GO:0003700,GO:0000981,GO:0140297,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0000977,GO:0061629,GO:0043565,GO:0046332,GO:0006915,GO:0061337,GO:0030154,GO:0071277,GO:0048813,GO:0006351,GO:0070375,GO:0007507,GO:0000165,GO:0000002,GO:0048311,GO:0000122,GO:0010613,GO:0045893,GO:0010628,GO:0046326,GO:0045944,GO:0006355,GO:0055005", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following reference in the Reactome database: R-MMU-525793", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following reference in the KEGG database: mmu:17258", "the MEF2A gene (UniProt: Q60929) in the Mus musculus (Mouse) species has the following reference in the AlphaFoldDB database: Q60929", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following reference in the GO database: GO:0005634,GO:0003682,GO:0000981,GO:0140297,GO:0035035,GO:0042826,GO:0046983,GO:0000978,GO:0000977,GO:0046332,GO:0006915,GO:0061337,GO:0071277,GO:0048813,GO:0070375,GO:0000165,GO:0000002,GO:0048311,GO:0000122,GO:0045944,GO:0006357,GO:0055005", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following reference in the KEGG database: bta:407231", "the MEF2A gene (UniProt: A2VDZ3) in the Bos taurus (Bovine) species has the following reference in the AlphaFoldDB database: A2VDZ3", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following reference in the GO database: GO:0000785,GO:0005654,GO:0005634,GO:0005667,GO:0003682,GO:0003677,GO:0001228,GO:0003700,GO:0000981,GO:0140297,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0000977,GO:0061629,GO:0043565,GO:0046332,GO:0006915,GO:0061337,GO:0030154,GO:0071277,GO:0071333,GO:0048813,GO:0006351,GO:0070375,GO:0007507,GO:0000165,GO:0000002,GO:0048311,GO:0000122,GO:0010613,GO:0045893,GO:0010628,GO:0046326,GO:0045944,GO:0006355,GO:0055005", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following reference in the Reactome database: R-RNO-525793", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following reference in the KEGG database: rno:309957", "the MEF2A gene (UniProt: Q2MJT0) in the Rattus norvegicus (Rat) species has the following reference in the AlphaFoldDB database: Q2MJT0", "the MEF2A gene (UniProt: Q03414) in the Xenopus laevis (African clawed frog) species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0019901,GO:0000977,GO:0043565,GO:0009952,GO:0045944", "the MEF2A gene (UniProt: Q03414) in the Xenopus laevis (African clawed frog) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: Q03414) in the Xenopus laevis (African clawed frog) species has the following reference in the KEGG database: xla:380452", "the MEF2A gene (UniProt: Q03414) in the Xenopus laevis (African clawed frog) species has the following reference in the AlphaFoldDB database: Q03414", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following reference in the GO database: GO:0005634,GO:0003682,GO:0000981,GO:0140297,GO:0035035,GO:0042826,GO:0046983,GO:0000978,GO:0000977,GO:0046332,GO:0006915,GO:0061337,GO:0071277,GO:0048813,GO:0070375,GO:0000165,GO:0000002,GO:0048311,GO:0000122,GO:0045944,GO:0006357,GO:0055005", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following reference in the KEGG database: ssc:100037273", "the MEF2A gene (UniProt: A2ICN5) in the Sus scrofa (Pig) species has the following reference in the AlphaFoldDB database: A2ICN5", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following reference in the GO database: GO:0005634,GO:0003682,GO:0000981,GO:0140297,GO:0035035,GO:0042826,GO:0046983,GO:0000977,GO:0046332,GO:0006915,GO:0061337,GO:0071277,GO:0048813,GO:0070375,GO:0000165,GO:0000002,GO:0048311,GO:0000122,GO:0045944,GO:0055005", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following reference in the KEGG database: pon:100171617", "the MEF2A gene (UniProt: Q5REW7) in the Pongo abelii (Sumatran orangutan) species has the following reference in the AlphaFoldDB database: Q5REW7", "the MEF2A gene (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000978,GO:0030154,GO:0045944,GO:0010468,GO:1901261,GO:0031285", "the MEF2A gene (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following reference in the KEGG database: ddi:DDB_G0268920", "the MEF2A gene (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following reference in the AlphaFoldDB database: Q55F37", "the MEF2A gene (UniProt: Q9W6U8) in the Gallus gallus (Chicken) species has the following reference in the GO database: GO:0005634,GO:0003682,GO:0000981,GO:0046983,GO:0000978,GO:0006915,GO:0030154,GO:0007399,GO:0045944,GO:0006357", "the MEF2A gene (UniProt: Q9W6U8) in the Gallus gallus (Chicken) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: Q9W6U8) in the Gallus gallus (Chicken) species has the following reference in the AlphaFoldDB database: Q9W6U8", "the MEF2A gene (UniProt: A0A0S2Z4N0) in the Homo sapiens (Human) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0003682,GO:0001228,GO:0140297,GO:0046983,GO:0019901,GO:0000978,GO:0061337,GO:0006351,GO:0000002,GO:0048311,GO:0007399,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: A0A0S2Z4N0) in the Homo sapiens (Human) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A0S2Z4N0) in the Homo sapiens (Human) species has the following reference in the KEGG database: hsa:4205", "the MEF2A gene (UniProt: A0A0S2Z4N0) in the Homo sapiens (Human) species has the following reference in the AlphaFoldDB database: A0A0S2Z4N0", "the MEF2A gene (UniProt: A0A2K5VXV0) in the Macaca fascicularis (Crab-eating macaque) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: A0A2K5VXV0) in the Macaca fascicularis (Crab-eating macaque) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A2K5VXV0) in the Macaca fascicularis (Crab-eating macaque) species has the following reference in the AlphaFoldDB database: A0A2K5VXV0", "the MEF2A gene (UniProt: A0A8C5XN58) in the Microcebus murinus (Gray mouse lemur) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: A0A8C5XN58) in the Microcebus murinus (Gray mouse lemur) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A8C5XN58) in the Microcebus murinus (Gray mouse lemur) species has the following reference in the KEGG database: mmur:105871273", "the MEF2A gene (UniProt: A0A2I3FW04) in the Nomascus leucogenys (Northern white-cheeked gibbon) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: A0A2I3FW04) in the Nomascus leucogenys (Northern white-cheeked gibbon) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A2I3FW04) in the Nomascus leucogenys (Northern white-cheeked gibbon) species has the following reference in the AlphaFoldDB database: A0A2I3FW04", "the MEF2A gene (UniProt: A0A2K5KTE9) in the Cercocebus atys (Sooty mangabey) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: A0A2K5KTE9) in the Cercocebus atys (Sooty mangabey) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A2K5KTE9) in the Cercocebus atys (Sooty mangabey) species has the following reference in the AlphaFoldDB database: A0A2K5KTE9", "the MEF2A gene (UniProt: A0A2K6BKN0) in the Macaca nemestrina (Pig-tailed macaque) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: A0A2K6BKN0) in the Macaca nemestrina (Pig-tailed macaque) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A2K6BKN0) in the Macaca nemestrina (Pig-tailed macaque) species has the following reference in the KEGG database: mni:105479408", "the MEF2A gene (UniProt: A0A2K6BKN0) in the Macaca nemestrina (Pig-tailed macaque) species has the following reference in the AlphaFoldDB database: A0A2K6BKN0", "the MEF2A gene (UniProt: A0A2R9B3G6) in the Pan paniscus (Pygmy chimpanzee) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: A0A2R9B3G6) in the Pan paniscus (Pygmy chimpanzee) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A2R9B3G6) in the Pan paniscus (Pygmy chimpanzee) species has the following reference in the AlphaFoldDB database: A0A2R9B3G6", "the MEF2A gene (UniProt: F6ZR05) in the Equus caballus (Horse) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0000981,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0030154,GO:0071277,GO:0006351,GO:0070375,GO:0007507,GO:0000002,GO:0048311,GO:0000122,GO:0010613,GO:0010628,GO:0046326,GO:0045944,GO:0055005", "the MEF2A gene (UniProt: F6ZR05) in the Equus caballus (Horse) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: F6ZR05) in the Equus caballus (Horse) species has the following reference in the KEGG database: ecb:100050068", "the MEF2A gene (UniProt: G1TNW4) in the Oryctolagus cuniculus (Rabbit) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: G1TNW4) in the Oryctolagus cuniculus (Rabbit) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: G1TNW4) in the Oryctolagus cuniculus (Rabbit) species has the following reference in the AlphaFoldDB database: G1TNW4", "the MEF2A gene (UniProt: G3SD93) in the Gorilla gorilla gorilla (Western lowland gorilla) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0000981,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0030154,GO:0071277,GO:0006351,GO:0070375,GO:0007507,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0045944,GO:0055005", "the MEF2A gene (UniProt: G3SD93) in the Gorilla gorilla gorilla (Western lowland gorilla) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: G3SD93) in the Gorilla gorilla gorilla (Western lowland gorilla) species has the following reference in the AlphaFoldDB database: G3SD93", "the MEF2A gene (UniProt: H9FUJ6) in the Macaca mulatta (Rhesus macaque) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0000981,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0030154,GO:0071277,GO:0006351,GO:0070375,GO:0007507,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0045944,GO:0055005", "the MEF2A gene (UniProt: H9FUJ6) in the Macaca mulatta (Rhesus macaque) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: I3LQ39) in the Sus scrofa (Pig) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0000981,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0030154,GO:0071277,GO:0006351,GO:0070375,GO:0007507,GO:0000002,GO:0048311,GO:0000122,GO:0010613,GO:0010628,GO:0046326,GO:0045944,GO:0055005", "the MEF2A gene (UniProt: I3LQ39) in the Sus scrofa (Pig) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: I3LQ39) in the Sus scrofa (Pig) species has the following reference in the Reactome database: R-SSC-525793", "the MEF2A gene (UniProt: I3LQ39) in the Sus scrofa (Pig) species has the following reference in the AlphaFoldDB database: I3LQ39", "the MEF2A gene (UniProt: A0A0D9RWI6) in the Chlorocebus sabaeus (Green monkey) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: A0A0D9RWI6) in the Chlorocebus sabaeus (Green monkey) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A0D9RWI6) in the Chlorocebus sabaeus (Green monkey) species has the following reference in the AlphaFoldDB database: A0A0D9RWI6", "the MEF2A gene (UniProt: A0A286Y288) in the Cavia porcellus (Guinea pig) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A gene (UniProt: A0A286Y288) in the Cavia porcellus (Guinea pig) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A286Y288) in the Cavia porcellus (Guinea pig) species has the following reference in the AlphaFoldDB database: A0A286Y288", "the MEF2A gene (UniProt: A0A2I3S0F9) in the Pan troglodytes (Chimpanzee) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0000981,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0030154,GO:0071277,GO:0006351,GO:0070375,GO:0007507,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0045944,GO:0055005", "the MEF2A gene (UniProt: A0A2I3S0F9) in the Pan troglodytes (Chimpanzee) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: A0A2I3S0F9) in the Pan troglodytes (Chimpanzee) species has the following reference in the AlphaFoldDB database: A0A2I3S0F9", "the MEF2A gene (UniProt: M3X8U4) in the Felis catus (Cat) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0000981,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0030154,GO:0071277,GO:0006351,GO:0070375,GO:0007507,GO:0000002,GO:0048311,GO:0000122,GO:0010613,GO:0010628,GO:0046326,GO:0045944,GO:0055005", "the MEF2A gene (UniProt: M3X8U4) in the Felis catus (Cat) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A gene (UniProt: M3X8U4) in the Felis catus (Cat) species has the following reference in the AlphaFoldDB database: M3X8U4", "the MEF2A protein (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000978,GO:0030154,GO:0045944,GO:0010468,GO:1901261,GO:0031285", "the MEF2A protein (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2A protein (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following reference in the KEGG database: ddi:DDB_G0268920", "the MEF2A protein (UniProt: Q55F37) in the Dictyostelium discoideum (Social amoeba) species has the following reference in the AlphaFoldDB database: Q55F37", "the MEF2A protein (UniProt: A0A2J8VXQ5) in the Pongo abelii (Sumatran orangutan) species has the following reference in the GO database: GO:0000785,GO:0005829,GO:0005654,GO:0005667,GO:0003682,GO:0001228,GO:0035035,GO:0042826,GO:0046982,GO:0019901,GO:0000978,GO:0061629,GO:0046332,GO:0061337,GO:0071277,GO:0006351,GO:0070375,GO:0000002,GO:0048311,GO:0000122,GO:0007399,GO:0010613,GO:0010628,GO:0046326,GO:0055005", "the MEF2A protein (UniProt: A0A2J8VXQ5) in the Pongo abelii (Sumatran orangutan) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A protein (UniProt: A1YGF0) in the Pan paniscus (Pygmy chimpanzee) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0007399,GO:0045893", "the MEF2A protein (UniProt: A1YGF0) in the Pan paniscus (Pygmy chimpanzee) species has the following reference in the InterPro database: IPR022102,IPR002100,IPR036879", "the MEF2A protein (UniProt: A1YGF0) in the Pan paniscus (Pygmy chimpanzee) species has the following reference in the AlphaFoldDB database: A1YGF0", "the MEF2A protein (UniProt: A2D5A9) in the Hylobates klossii (Kloss's gibbon) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0007399,GO:0045893", "the MEF2A protein (UniProt: A2D5A9) in the Hylobates klossii (Kloss's gibbon) species has the following reference in the InterPro database: IPR022102,IPR002100,IPR036879", "the MEF2A protein (UniProt: A2D5A9) in the Hylobates klossii (Kloss's gibbon) species has the following reference in the AlphaFoldDB database: A2D5A9", "the MEF2A protein (UniProt: A2T7W8) in the Pongo pygmaeus (Bornean orangutan) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0007399,GO:0045893", "the MEF2A protein (UniProt: A2T7W8) in the Pongo pygmaeus (Bornean orangutan) species has the following reference in the InterPro database: IPR022102,IPR002100,IPR036879", "the MEF2A protein (UniProt: A2T7W8) in the Pongo pygmaeus (Bornean orangutan) species has the following reference in the AlphaFoldDB database: A2T7W8", "the MEF2A protein (UniProt: A2T7B1) in the Pan troglodytes (Chimpanzee) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0007399,GO:0045893", "the MEF2A protein (UniProt: A2T7B1) in the Pan troglodytes (Chimpanzee) species has the following reference in the InterPro database: IPR022102,IPR002100,IPR036879", "the MEF2A protein (UniProt: A2T7B1) in the Pan troglodytes (Chimpanzee) species has the following reference in the AlphaFoldDB database: A2T7B1", "the MEF2A protein (UniProt: A0A803KHQ2) in the Pan troglodytes (Chimpanzee) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0007399,GO:0045944", "the MEF2A protein (UniProt: A0A803KHQ2) in the Pan troglodytes (Chimpanzee) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A protein (UniProt: A0A803KHQ2) in the Pan troglodytes (Chimpanzee) species has the following reference in the AlphaFoldDB database: A0A803KHQ2", "the MEF2A protein (UniProt: A0A6D2WIU1) in the Pongo abelii (Sumatran orangutan) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0007399,GO:0045944", "the MEF2A protein (UniProt: A0A6D2WIU1) in the Pongo abelii (Sumatran orangutan) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A protein (UniProt: A0A6D2WIU1) in the Pongo abelii (Sumatran orangutan) species has the following reference in the AlphaFoldDB database: A0A6D2WIU1", "the MEF2A protein (UniProt: A0A8J7NFF1) in the Atractosteus spatula (Alligator gar) species has the following reference in the GO database: GO:0016020,GO:0005634,GO:0003677,GO:0046983,GO:0006351,GO:0045893", "the MEF2A protein (UniProt: A0A8J7NFF1) in the Atractosteus spatula (Alligator gar) species has the following reference in the InterPro database: IPR022102,IPR002100,IPR036879", "the MEF2A protein (UniProt: A0A3Q1HM09) in the Anabas testudineus (Climbing perch) species has the following reference in the GO database: GO:0045121,GO:0005886,GO:0050853,GO:0035556,GO:0050868,GO:0050852", "the MEF2A protein (UniProt: A0A3Q1HM09) in the Anabas testudineus (Climbing perch) species has the following reference in the InterPro database: IPR026072,IPR032748", "the MEF2A protein (UniProt: A0A3Q1HM09) in the Anabas testudineus (Climbing perch) species has the following reference in the AlphaFoldDB database: A0A3Q1HM09", "the MEF2A protein (UniProt: A0A6D2VXR9) in the Pan troglodytes (Chimpanzee) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0007399,GO:0045944", "the MEF2A protein (UniProt: A0A6D2VXR9) in the Pan troglodytes (Chimpanzee) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A protein (UniProt: A0A6D2VXR9) in the Pan troglodytes (Chimpanzee) species has the following reference in the AlphaFoldDB database: A0A6D2VXR9", "the MEF2A protein (UniProt: A0A6D2WBN7) in the Pan troglodytes (Chimpanzee) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0007399,GO:0045944", "the MEF2A protein (UniProt: A0A6D2WBN7) in the Pan troglodytes (Chimpanzee) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A protein (UniProt: A0A6D2WBN7) in the Pan troglodytes (Chimpanzee) species has the following reference in the AlphaFoldDB database: A0A6D2WBN7", "the MEF2A protein (UniProt: A0A6I9SJL8) in the Elaeis guineensis var. tenera (Oil palm) species has the following reference in the GO database: GO:0005634,GO:0000987,GO:0000981,GO:0046983,GO:0006351,GO:0045944", "the MEF2A protein (UniProt: A0A6I9SJL8) in the Elaeis guineensis var. tenera (Oil palm) species has the following reference in the InterPro database: IPR033897,IPR002100,IPR036879", "the MEF2A protein (UniProt: A0A6I9SJL8) in the Elaeis guineensis var. tenera (Oil palm) species has the following reference in the KEGG database: egu:105061531", "the MEF2A protein (UniProt: A0A6I9SJL8) in the Elaeis guineensis var. tenera (Oil palm) species has the following reference in the AlphaFoldDB database: A0A6I9SJL8", "the MEF2A protein (UniProt: A0A1I8MXS1) in the Musca domestica (House fly) species has the following reference in the GO database: GO:0005634,GO:0003700,GO:0043565,GO:0045893,GO:0006357", "the MEF2A protein (UniProt: A0A1I8MXS1) in the Musca domestica (House fly) species has the following reference in the InterPro database: IPR000253,IPR001766,IPR008984,IPR018122,IPR030456,IPR036388,IPR036390", "the MEF2A protein (UniProt: A0A6P8WX58) in the Drosophila albomicans (Fruit fly) species has the following reference in the GO database: GO:0005634,GO:0003677,GO:0003700,GO:0006357", "the MEF2A protein (UniProt: A0A6P8WX58) in the Drosophila albomicans (Fruit fly) species has the following reference in the InterPro database: IPR004827,IPR046347,IPR040223", "the MEF2A protein (UniProt: A0A6P8WX58) in the Drosophila albomicans (Fruit fly) species has the following reference in the AlphaFoldDB database: A0A6P8WX58", "the MEF2A protein (UniProt: A0A9J7IEP5) in the Musca domestica (House fly) species has the following reference in the GO database: GO:0005634,GO:0003700,GO:0043565,GO:0045893,GO:0006357", "the MEF2A protein (UniProt: A0A9J7IEP5) in the Musca domestica (House fly) species has the following reference in the InterPro database: IPR000253,IPR001766,IPR008984,IPR018122,IPR030456,IPR036388,IPR036390", "the MEF2A protein (UniProt: A0A9J7IFU3) in the Musca domestica (House fly) species has the following reference in the GO database: GO:0005634,GO:0003700,GO:0043565,GO:0045893,GO:0006357", "the MEF2A protein (UniProt: A0A9J7IFU3) in the Musca domestica (House fly) species has the following reference in the InterPro database: IPR000253,IPR001766,IPR008984,IPR018122,IPR030456,IPR036388,IPR036390", "the MEF2A protein (UniProt: A0A6P8JR31) in the Drosophila mauritiana (Fruit fly) species has the following reference in the GO database: GO:0005634,GO:0003677,GO:0003700,GO:0006357", "the MEF2A protein (UniProt: A0A6P8JR31) in the Drosophila mauritiana (Fruit fly) species has the following reference in the InterPro database: IPR004827,IPR046347,IPR040223", "the MEF2A protein (UniProt: A0A9J7DH70) in the Musca domestica (House fly) species has the following reference in the GO database: GO:0005634,GO:0003700,GO:0043565,GO:0045893,GO:0006357", "the MEF2A protein (UniProt: A0A9J7DH70) in the Musca domestica (House fly) species has the following reference in the InterPro database: IPR000253,IPR001766,IPR008984,IPR018122,IPR030456,IPR036388,IPR036390", "the MEF2A protein (UniProt: A0A6I8WAQ4) in the Drosophila pseudoobscura pseudoobscura (Fruit fly) species has the following reference in the GO database: GO:0005634,GO:0003677,GO:0003700,GO:0006357", "the MEF2A protein (UniProt: A0A6I8WAQ4) in the Drosophila pseudoobscura pseudoobscura (Fruit fly) species has the following reference in the InterPro database: IPR004827,IPR046347,IPR040223", "the MEF2A protein (UniProt: A0A6I8WAQ4) in the Drosophila pseudoobscura pseudoobscura (Fruit fly) species has the following reference in the AlphaFoldDB database: A0A6I8WAQ4", "the MEF2A protein (UniProt: A0A6P8X5J3) in the Drosophila albomicans (Fruit fly) species has the following reference in the GO database: GO:0005634,GO:0003677,GO:0003700,GO:0006357", "the MEF2A protein (UniProt: A0A6P8X5J3) in the Drosophila albomicans (Fruit fly) species has the following reference in the InterPro database: IPR004827,IPR046347,IPR040223", "the MEF2A protein (UniProt: A0A6P8X5J3) in the Drosophila albomicans (Fruit fly) species has the following reference in the AlphaFoldDB database: A0A6P8X5J3", "the MEF2A protein (UniProt: A0A6P8JS87) in the Drosophila mauritiana (Fruit fly) species has the following reference in the GO database: GO:0005634,GO:0003677,GO:0003700,GO:0006357", "the MEF2A protein (UniProt: A0A6P8JS87) in the Drosophila mauritiana (Fruit fly) species has the following reference in the InterPro database: IPR004827,IPR046347,IPR040223", "the MEF2A protein (UniProt: A0A6P8JS87) in the Drosophila mauritiana (Fruit fly) species has the following reference in the AlphaFoldDB database: A0A6P8JS87", "the MEF2A protein (UniProt: A0A9J7DKU8) in the Musca domestica (House fly) species has the following reference in the GO database: GO:0005634,GO:0003700,GO:0043565,GO:0045893,GO:0006357", "the MEF2A protein (UniProt: A0A9J7DKU8) in the Musca domestica (House fly) species has the following reference in the InterPro database: IPR000253,IPR001766,IPR008984,IPR018122,IPR030456,IPR036388,IPR036390", "the MEF2A protein (UniProt: A0A9J7DKU8) in the Musca domestica (House fly) species has the following reference in the KEGG database: mde:101890549", "the MEF2A protein (UniProt: A0A2J8VXR4) in the Pongo abelii (Sumatran orangutan) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0007399,GO:0045944", "the MEF2A protein (UniProt: A0A2J8VXR4) in the Pongo abelii (Sumatran orangutan) species has the following reference in the InterPro database: IPR022102,IPR033896,IPR002100,IPR036879", "the MEF2A protein (UniProt: L0R504) in the Homo sapiens (Human) species has the following reference in the AlphaFoldDB database: L0R504", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following reference in the GO database: GO:0030054,GO:0000785,GO:0005829,GO:0005654,GO:0005634,GO:0005667,GO:0001228,GO:0003700,GO:0000981,GO:0042826,GO:0046983,GO:0000978,GO:1990837,GO:0030154,GO:0007507,GO:0007517,GO:0045944", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following reference in the Pharos database: Q02080", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following reference in the Reactome database: R-HSA-525793", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following reference in the KEGG database: hsa:100271849,hsa:4207", "the MEF2B gene (UniProt: Q02080) in the Homo sapiens (Human) species has the following reference in the AlphaFoldDB database: Q02080", "the MEF2B gene (UniProt: O55087) in the Mus musculus (Mouse) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0005634,GO:0005667,GO:0001228,GO:0003700,GO:0000981,GO:0042826,GO:0046983,GO:0000978,GO:1990837,GO:0030154,GO:0007507,GO:0045944,GO:0006355", "the MEF2B gene (UniProt: O55087) in the Mus musculus (Mouse) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: O55087) in the Mus musculus (Mouse) species has the following reference in the Reactome database: R-MMU-525793", "the MEF2B gene (UniProt: O55087) in the Mus musculus (Mouse) species has the following reference in the AlphaFoldDB database: O55087", "the MEF2B gene (UniProt: Q6AXR7) in the Rattus norvegicus (Rat) species has the following reference in the GO database: GO:0005634,GO:0005667,GO:0001228,GO:0003700,GO:0000981,GO:0042826,GO:0046983,GO:0000978,GO:1990837,GO:0030154,GO:0006351,GO:0007507,GO:0045944,GO:0006355", "the MEF2B gene (UniProt: Q6AXR7) in the Rattus norvegicus (Rat) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: Q6AXR7) in the Rattus norvegicus (Rat) species has the following reference in the Reactome database: R-RNO-525793", "the MEF2B gene (UniProt: Q6AXR7) in the Rattus norvegicus (Rat) species has the following reference in the KEGG database: rno:498607", "the MEF2B gene (UniProt: J7HE56) in the Danio rerio (Zebrafish) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0042826,GO:0046983,GO:0000978,GO:0030154,GO:0006351,GO:0007507,GO:0045944", "the MEF2B gene (UniProt: J7HE56) in the Danio rerio (Zebrafish) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: J7HE56) in the Danio rerio (Zebrafish) species has the following reference in the Reactome database: R-DRE-525793", "the MEF2B gene (UniProt: J7HE56) in the Danio rerio (Zebrafish) species has the following reference in the KEGG database: dre:558073", "the MEF2B gene (UniProt: B3KQ23) in the Homo sapiens (Human) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: B3KQ23) in the Homo sapiens (Human) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: B8ZZJ5) in the Homo sapiens (Human) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: B8ZZJ5) in the Homo sapiens (Human) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: B8ZZJ5) in the Homo sapiens (Human) species has the following reference in the AlphaFoldDB database: B8ZZJ5", "the MEF2B gene (UniProt: C9J4J4) in the Homo sapiens (Human) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: C9J4J4) in the Homo sapiens (Human) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: C9J4J4) in the Homo sapiens (Human) species has the following reference in the AlphaFoldDB database: C9J4J4", "the MEF2B gene (UniProt: A0A1D5QKX1) in the Macaca mulatta (Rhesus macaque) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005765,GO:0005654,GO:0005667,GO:0001228,GO:0000981,GO:0042826,GO:0046983,GO:0000978,GO:0030154,GO:0006351,GO:0007507,GO:0045944", "the MEF2B gene (UniProt: A0A1D5QKX1) in the Macaca mulatta (Rhesus macaque) species has the following reference in the InterPro database: IPR019320,IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A1D5QKX1) in the Macaca mulatta (Rhesus macaque) species has the following reference in the AlphaFoldDB database: A0A1D5QKX1", "the MEF2B gene (UniProt: A0A8I6GDA6) in the Rattus norvegicus (Rat) species has the following reference in the GO database: GO:0005634,GO:0005667,GO:0001228,GO:0003700,GO:0000981,GO:0042826,GO:0046983,GO:0000978,GO:1990837,GO:0030154,GO:0006351,GO:0007507,GO:0045944,GO:0006355", "the MEF2B gene (UniProt: A0A8I6GDA6) in the Rattus norvegicus (Rat) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A8M3AXP2) in the Danio rerio (Zebrafish) species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: A0A8M3AXP2) in the Danio rerio (Zebrafish) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: K7N7F1) in the Mus musculus (Mouse) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0005667,GO:0001228,GO:0042826,GO:0046983,GO:0000978,GO:0006351", "the MEF2B gene (UniProt: K7N7F1) in the Mus musculus (Mouse) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: K7N7F1) in the Mus musculus (Mouse) species has the following reference in the KEGG database: mmu:105980076", "the MEF2B gene (UniProt: A0A8M2BHT0) in the Danio rerio (Zebrafish) species has the following reference in the GO database: GO:0005765", "the MEF2B gene (UniProt: A0A8M2BHT0) in the Danio rerio (Zebrafish) species has the following reference in the InterPro database: IPR019320", "the MEF2B gene (UniProt: F2Z4G1) in the Bos taurus (Bovine) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0005667,GO:0001228,GO:0000981,GO:0042826,GO:0046983,GO:0000978,GO:0030154,GO:0006351,GO:0007507,GO:0045944", "the MEF2B gene (UniProt: F2Z4G1) in the Bos taurus (Bovine) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: F2Z4G1) in the Bos taurus (Bovine) species has the following reference in the Reactome database: R-BTA-525793", "the MEF2B gene (UniProt: F7EZT3) in the Rattus norvegicus (Rat) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0005667,GO:0001228,GO:0003700,GO:0000981,GO:0042826,GO:0046983,GO:0000978,GO:1990837,GO:0030154,GO:0006351,GO:0007507,GO:0045944,GO:0006355", "the MEF2B gene (UniProt: F7EZT3) in the Rattus norvegicus (Rat) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A1C7ND04) in the Choanephora cucurbitarum () species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: A0A1C7ND04) in the Choanephora cucurbitarum () species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A1C7ND04) in the Choanephora cucurbitarum () species has the following reference in the AlphaFoldDB database: A0A1C7ND04", "the MEF2B gene (UniProt: A0A218UC21) in the Lonchura striata domestica (Bengalese finch) species has the following reference in the GO database: GO:0005765,GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: A0A218UC21) in the Lonchura striata domestica (Bengalese finch) species has the following reference in the InterPro database: IPR019320,IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A218UC21) in the Lonchura striata domestica (Bengalese finch) species has the following reference in the AlphaFoldDB database: A0A218UC21", "the MEF2B gene (UniProt: A0A2I3LNM2) in the Papio anubis (Olive baboon) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: A0A2I3LNM2) in the Papio anubis (Olive baboon) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A2I3LNM2) in the Papio anubis (Olive baboon) species has the following reference in the AlphaFoldDB database: A0A2I3LNM2", "the MEF2B gene (UniProt: A0A2J8T5J0) in the Pongo abelii (Sumatran orangutan) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: A0A2J8T5J0) in the Pongo abelii (Sumatran orangutan) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A2K5C9I0) in the Aotus nancymaae (Ma's night monkey) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0005667,GO:0001228,GO:0042826,GO:0046983,GO:0000978,GO:0048513,GO:0006351", "the MEF2B gene (UniProt: A0A2K5C9I0) in the Aotus nancymaae (Ma's night monkey) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A2K5C9I0) in the Aotus nancymaae (Ma's night monkey) species has the following reference in the AlphaFoldDB database: A0A2K5C9I0", "the MEF2B gene (UniProt: A0A2K6DJ63) in the Macaca nemestrina (Pig-tailed macaque) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0005667,GO:0001228,GO:0042826,GO:0046983,GO:0000978,GO:0048513,GO:0006351", "the MEF2B gene (UniProt: A0A2K6DJ63) in the Macaca nemestrina (Pig-tailed macaque) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A2K6DJ63) in the Macaca nemestrina (Pig-tailed macaque) species has the following reference in the AlphaFoldDB database: A0A2K6DJ63", "the MEF2B gene (UniProt: A0A2K6GD45) in the Propithecus coquereli (Coquerel's sifaka) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0005667,GO:0001228,GO:0042826,GO:0046983,GO:0000978,GO:0048513,GO:0006351", "the MEF2B gene (UniProt: A0A2K6GD45) in the Propithecus coquereli (Coquerel's sifaka) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A2K6GD45) in the Propithecus coquereli (Coquerel's sifaka) species has the following reference in the KEGG database: pcoq:105818198", "the MEF2B gene (UniProt: A0A2K6GD45) in the Propithecus coquereli (Coquerel's sifaka) species has the following reference in the AlphaFoldDB database: A0A2K6GD45", "the MEF2B gene (UniProt: A0A2K6LUS1) in the Rhinopithecus bieti (Black snub-nosed monkey) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: A0A2K6LUS1) in the Rhinopithecus bieti (Black snub-nosed monkey) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A2K6LUS1) in the Rhinopithecus bieti (Black snub-nosed monkey) species has the following reference in the AlphaFoldDB database: A0A2K6LUS1", "the MEF2B gene (UniProt: A0A2K6T7P7) in the Saimiri boliviensis boliviensis (Bolivian squirrel monkey) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045893", "the MEF2B gene (UniProt: A0A2K6T7P7) in the Saimiri boliviensis boliviensis (Bolivian squirrel monkey) species has the following reference in the InterPro database: IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A2K6T7P7) in the Saimiri boliviensis boliviensis (Bolivian squirrel monkey) species has the following reference in the AlphaFoldDB database: A0A2K6T7P7", "the MEF2B gene (UniProt: A0A2R9A792) in the Pan paniscus (Pygmy chimpanzee) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B gene (UniProt: A0A2R9A792) in the Pan paniscus (Pygmy chimpanzee) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A2R9A792) in the Pan paniscus (Pygmy chimpanzee) species has the following reference in the AlphaFoldDB database: A0A2R9A792", "the MEF2B gene (UniProt: A0A8B7EPD9) in the Microcebus murinus (Gray mouse lemur) species has the following reference in the GO database: GO:0005634,GO:0003677,GO:0000981,GO:0046983,GO:0048513,GO:0006351,GO:0045893", "the MEF2B gene (UniProt: A0A8B7EPD9) in the Microcebus murinus (Gray mouse lemur) species has the following reference in the InterPro database: IPR002100,IPR036879", "the MEF2B gene (UniProt: A0A8B7EPD9) in the Microcebus murinus (Gray mouse lemur) species has the following reference in the KEGG database: mmur:105858339", "the MEF2B protein (UniProt: Q96FH0) in the Homo sapiens (Human) species has the following reference in the GO database: GO:0099078,GO:0098574,GO:0007507,GO:0032418,GO:0072384,GO:0051036,GO:0062196", "the MEF2B protein (UniProt: Q96FH0) in the Homo sapiens (Human) species has the following reference in the InterPro database: IPR019320", "the MEF2B protein (UniProt: Q96FH0) in the Homo sapiens (Human) species has the following reference in the Pharos database: Q96FH0", "the MEF2B protein (UniProt: Q96FH0) in the Homo sapiens (Human) species has the following reference in the KEGG database: hsa:729991", "the MEF2B protein (UniProt: Q96FH0) in the Homo sapiens (Human) species has the following reference in the AlphaFoldDB database: Q96FH0", "the MEF2B protein (UniProt: H3BNR1) in the Homo sapiens (Human) species has the following reference in the GO database: GO:0030054,GO:0005829,GO:0005654,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: H3BNR1) in the Homo sapiens (Human) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: H3BNR1) in the Homo sapiens (Human) species has the following reference in the AlphaFoldDB database: H3BNR1", "the MEF2B protein (UniProt: A2T7D3) in the Pan troglodytes (Chimpanzee) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045893", "the MEF2B protein (UniProt: A2T7D3) in the Pan troglodytes (Chimpanzee) species has the following reference in the InterPro database: IPR002100,IPR036879", "the MEF2B protein (UniProt: A2T7D3) in the Pan troglodytes (Chimpanzee) species has the following reference in the AlphaFoldDB database: A2T7D3", "the MEF2B protein (UniProt: A0A8X8BMY2) in the Polypterus senegalus (Senegal bichir) species has the following reference in the GO database: GO:0016020,GO:0005634,GO:0003677,GO:0046983,GO:0006351,GO:0045893", "the MEF2B protein (UniProt: A0A8X8BMY2) in the Polypterus senegalus (Senegal bichir) species has the following reference in the InterPro database: IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A2J8T5I8) in the Pongo abelii (Sumatran orangutan) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A2J8T5I8) in the Pongo abelii (Sumatran orangutan) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A2J8T5I8) in the Pongo abelii (Sumatran orangutan) species has the following reference in the AlphaFoldDB database: A0A2J8T5I8", "the MEF2B protein (UniProt: A0A2J8T5K4) in the Pongo abelii (Sumatran orangutan) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A2J8T5K4) in the Pongo abelii (Sumatran orangutan) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A2J8T5K4) in the Pongo abelii (Sumatran orangutan) species has the following reference in the KEGG database: pon:100568307", "the MEF2B protein (UniProt: A0A2J8T5K4) in the Pongo abelii (Sumatran orangutan) species has the following reference in the AlphaFoldDB database: A0A2J8T5K4", "the MEF2B protein (UniProt: A0A2J8T5J0) in the Pongo abelii (Sumatran orangutan) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A2J8T5J0) in the Pongo abelii (Sumatran orangutan) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A2J8T5H8) in the Pongo abelii (Sumatran orangutan) species has the following reference in the GO database: GO:0005634,GO:0000981,GO:0046983,GO:0000977,GO:0048513,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A2J8T5H8) in the Pongo abelii (Sumatran orangutan) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A1YFA3) in the Gorilla gorilla (western gorilla) species has the following reference in the AlphaFoldDB database: A1YFA3", "the MEF2B protein (UniProt: A0A212D1I4) in the Cervus elaphus hippelaphus (European red deer) species has the following reference in the GO database: GO:0005634,GO:0003677,GO:0046983,GO:0006351,GO:0045893", "the MEF2B protein (UniProt: A0A212D1I4) in the Cervus elaphus hippelaphus (European red deer) species has the following reference in the InterPro database: IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A212D1I4) in the Cervus elaphus hippelaphus (European red deer) species has the following reference in the AlphaFoldDB database: A0A212D1I4", "the MEF2B protein (UniProt: A1YFA4) in the Gorilla gorilla (western gorilla) species has the following reference in the AlphaFoldDB database: A1YFA4", "the MEF2B protein (UniProt: A1YFU1) in the Saguinus labiatus (Red-chested mustached tamarin) species has the following reference in the AlphaFoldDB database: A1YFU1", "the MEF2B protein (UniProt: A0A3L8QB93) in the Chloebia gouldiae (Gouldian finch) species has the following reference in the AlphaFoldDB database: A0A3L8QB93", "the MEF2B protein (UniProt: A0A7K4WWR1) in the Tachuris rubrigastra () species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K4WWR1) in the Tachuris rubrigastra () species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K4WWR1) in the Tachuris rubrigastra () species has the following reference in the AlphaFoldDB database: A0A7K4WWR1", "the MEF2B protein (UniProt: A0A7K5A1K9) in the Centropus unirufus () species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K5A1K9) in the Centropus unirufus () species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K5A1K9) in the Centropus unirufus () species has the following reference in the AlphaFoldDB database: A0A7K5A1K9", "the MEF2B protein (UniProt: A0A7K6J344) in the Machaerirhynchus nigripectus () species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K6J344) in the Machaerirhynchus nigripectus () species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K6J344) in the Machaerirhynchus nigripectus () species has the following reference in the AlphaFoldDB database: A0A7K6J344", "the MEF2B protein (UniProt: A0A7K6K6R5) in the Oreocharis arfaki (tit berrypecker) species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K6K6R5) in the Oreocharis arfaki (tit berrypecker) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K6K6R5) in the Oreocharis arfaki (tit berrypecker) species has the following reference in the AlphaFoldDB database: A0A7K6K6R5", "the MEF2B protein (UniProt: A0A7K6W515) in the Steatornis caripensis (Oilbird) species has the following reference in the AlphaFoldDB database: A0A7K6W515", "the MEF2B protein (UniProt: A0A7K7UM36) in the Ibidorhyncha struthersii () species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K7UM36) in the Ibidorhyncha struthersii () species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K7UM36) in the Ibidorhyncha struthersii () species has the following reference in the AlphaFoldDB database: A0A7K7UM36", "the MEF2B protein (UniProt: A0A7K7XMD6) in the Mohoua ochrocephala () species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K7XMD6) in the Mohoua ochrocephala () species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K7XMD6) in the Mohoua ochrocephala () species has the following reference in the AlphaFoldDB database: A0A7K7XMD6", "the MEF2B protein (UniProt: A0A7K8KIA8) in the Lophotis ruficrista () species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K8KIA8) in the Lophotis ruficrista () species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K8KIA8) in the Lophotis ruficrista () species has the following reference in the AlphaFoldDB database: A0A7K8KIA8", "the MEF2B protein (UniProt: A0A7K8LMB0) in the Ardeotis kori () species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K8LMB0) in the Ardeotis kori () species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K8LMB0) in the Ardeotis kori () species has the following reference in the AlphaFoldDB database: A0A7K8LMB0", "the MEF2B protein (UniProt: A0A7K8W5V7) in the Sclerurus mexicanus (tawny-throated leaftosser) species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K8W5V7) in the Sclerurus mexicanus (tawny-throated leaftosser) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K8W5V7) in the Sclerurus mexicanus (tawny-throated leaftosser) species has the following reference in the AlphaFoldDB database: A0A7K8W5V7", "the MEF2B protein (UniProt: A0A7K9FRY9) in the Stercorarius parasiticus (Parasitic jaeger) species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7K9FRY9) in the Stercorarius parasiticus (Parasitic jaeger) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7K9FRY9) in the Stercorarius parasiticus (Parasitic jaeger) species has the following reference in the AlphaFoldDB database: A0A7K9FRY9", "the MEF2B protein (UniProt: A0A7L0DG20) in the Rostratula benghalensis (greater painted-snipe) species has the following reference in the GO database: GO:0005634,GO:0046983,GO:0000977,GO:0006351,GO:0045944", "the MEF2B protein (UniProt: A0A7L0DG20) in the Rostratula benghalensis (greater painted-snipe) species has the following reference in the InterPro database: IPR033896,IPR002100,IPR036879", "the MEF2B protein (UniProt: A0A7L0DG20) in the Rostratula benghalensis (greater painted-snipe) species has the following reference in the AlphaFoldDB database: A0A7L0DG20"]